[
    {
        "title": "Ken Cuccinelli says Trump using military will help drive migrant numbers at border 'down into the dirt'",
        "link": "https://thehill.com/policy/national-security/4997244-ken-cuccinelli-says-trump-using-military-will-help-drive-migrant-numbers-at-border-down-into-the-dirt/",
        "authors": [
            "Tara Suter"
        ],
        "date": "Tue, 19 Nov 2024 03:28:58 +0000",
        "summary": "Former senior Trump administration official Ken Cuccinelli said Monday that President-elect Trump “using the military” will help drive migrant numbers at the border “down into the dirt.” Cuccinelli told NewsNation's Blake Burman in an interview on \"The Hill\" that he believes early next year, \"you will see our military used between legal ports of entry,...",
        "content": "Former senior Trump administration official Ken Cuccinelli said Monday that President-elect Trump “using the military” will help drive migrant numbers at the border “down into the dirt.”    Cuccinelli told NewsNation's Blake Burman in an interview on \"The Hill\" that he believes early next year, \"you will see our military used between legal ports of entry, especially on the southern border, to finally gain control of that border\" adding that \"all immigration, all passage of any kind, will pass through legal ports of entry only.\"    Burman said Cuccinelli’s words about all immigration and all passage of any kind moving through legal ports of entry “sounds aspirational,” asking him if he actually believes “that can happen.”    In his response, Cuccinelli said Burman was “right” and that “it'll never be 100 percent, but it doesn't need to be to drive the numbers coming to the border down into the dirt,” adding that Trump will “do that using the military between the legal ports of entry.”    Trump has previously discussed the military being used on the “enemy from within,” at the border and possibly versus cartels in Mexico. The president-elect’s platform, known as Agenda 47, called for “moving thousands of troops currently stationed overseas” to the southern border.    “If you're sitting in, pick a country in Central or South America, ‘cause they still have the biggest numbers coming into the United States, and you're asking yourself the question, ‘Am I gonna spend my life savings on some coyote to get me into the United States, when what I see happening at the border is a complete blockage?’” Cuccinelli said on “The Hill.”    “The answer to that is no,” he added.    NewsNation is owned by Nexstar Media Group, which also owns The Hill.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "3daceedf-1312-3622-9450-7728db408411"
    },
    {
        "title": "Lara Trump says she hasn't talked to DeSantis about filling Rubio's seat",
        "link": "https://thehill.com/homenews/campaign/4997201-lara-trump-hasnt-talked-to-desantis-about-rubios-seat/",
        "authors": [
            "Tara Suter"
        ],
        "date": "Tue, 19 Nov 2024 02:20:24 +0000",
        "summary": "Republican National Committee co-chair Lara Trump said Monday that she hasn't talked to Florida Gov. Ron DeSantis (R) about filling Sen. Marco Rubio's (R-Fla.) seat. “Well, listen, this is obviously up to the governor, and I thought his post on X was very appropriate,” Lara Trump told radio hosts Rita Cosby and John Catsimatidis on...",
        "content": "Republican National Committee co-chair Lara Trump said Monday that she hasn't talked to Florida Gov. Ron DeSantis (R) about filling Sen. Marco Rubio's (R-Fla.) seat.    “Well, listen, this is obviously up to the governor, and I thought his post on X was very appropriate,” Lara Trump told radio hosts Rita Cosby and John Catsimatidis on the “Cats &amp; Cosby show on WABC 770 AM, seemingly referencing a Monday morning post on the social platform X by DeSantis.    “I think that's exactly the kind of person who should be serving in Marco Rubio’s Senate seat, and I have not had a conversation with him,” she continued, adding that she does “know the Make America Great Again, America First agenda better than anyone.”    In the Monday morning X post that President-elect Trump’s daughter-in-law appeared to reference in her “Cats &amp; Cosby” appearance, DeSantis said his state “deserves a Senator who will help President Trump deliver on his election mandate, be strong on immigration and border security, take on the entrenched bureaucracy and administrative state, reverse the nation’s fiscal decline, be animated by conservative principles, and has a proven record of results.”    Last week, Trump said he had picked Rubio to be his secretary of State in his upcoming administration. The president-elect said in a statement that the Florida senator, despite being a past rival to Trump, is a “Highly Respected Leader, and a very powerful Voice for Freedom.”    “He will be a strong Advocate for our Nation, a true friend to our Allies, and a fearless Warrior who will never back down to our adversaries,” he added.    In her Monday radio interview, Lara Trump said she is familiar with “the people of Florida.”    “I’ve been a Florida resident for three and a half years, and I’ve been really honored to serve as co-Chair of the RNC throughout the duration of this campaign,” she added. “And so listen, if I’m asked to serve in the capacity of the United States Senate, it’s something I would consider.”    The Hill has reached out to DeSantis’s communications office for comment.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "dc565a40-6079-323e-b79f-46bae147dab3"
    },
    {
        "title": "Johnson, Greene hold 'productive meeting' as Speaker vote nears",
        "link": "https://thehill.com/homenews/house/4997116-greene-johnson-meeting-speaker-vote/",
        "authors": [
            "Mychael Schnell"
        ],
        "date": "Tue, 19 Nov 2024 00:48:34 +0000",
        "summary": "Speaker Mike Johnson (R-La.) and Rep. Marjorie Taylor Greene (R-Ga.) gathered privately for a “productive” meeting last week, a source familiar with the situation and the congresswoman told The Hill, the latest sign of easing tensions between the two. The huddle — which took place Wednesday night of last week and ran for more than...",
        "content": "Speaker Mike Johnson (R-La.) and Rep. Marjorie Taylor Greene (R-Ga.) gathered privately for a “productive” meeting last week, a source familiar with the situation and the congresswoman told The Hill, the latest sign of easing tensions between the two.    The huddle — which took place Wednesday night of last week and ran for more than 30 minutes, according to the source —&nbsp;was described as “productive” by Greene. She declined to disclose specifics on what they discussed.    It came hours after House GOP lawmakers unanimously nominated Johnson&nbsp;to remain in the top job next year, a significant feat for the Louisiana Republican after facing some resistance within the conference. And it took place as the Jan. 3 Speaker vote on the House floor inches closer, when Johnson will again need near-unanimous support from the conference to win the gavel.    Johnson’s unanimous support last week included backing from Greene, who had emerged as one of the Speaker’s sharpest critics throughout his tenure in the top job —&nbsp;going as far as to lead a motion to vacate against the Louisiana Republican in May, which failed.    Greene, however, has appeared to change her tune this month, as President-elect Trump prepares to control the White House next year and Republicans prepare for full control of Washington.    That new posture was evident last week when Greene — on the eve of Johnson’s unanimous Speaker nomination — did not rule out supporting Johnson’s bid&nbsp;to keep the gavel.    “Well, I think he’s the only one running for Speaker, so I don’t understand everybody asking this question,” she said. “The American people overwhelmingly voted for President Trump’s agenda, not anyone else’s agenda, President Trump’s agenda, MAGA agenda, America First agenda. And I think that’s a mandate from the American people. So, I think whoever’s in charge here in the House, their job is to pass President Trump’s agenda.”    Pressed by The Hill on those comments — recognizing that it sounds like she was not ruling out opposing Johnson on the floor despite her past criticism —&nbsp;Greene once again left the door open.    “What I’ve been critical of is passing the Biden-Harris agenda in the House that’s funding, fully funding, an agenda that [Senate Majority Leader] Chuck Schumer [D-N.Y.] loved so much he passed it right through the Senate, reauthorizing FISA and warrantless spying on Americans and giving $60 billion to Ukraine,” Greene said. “But I really don’t think that’ll happen under President Trump. I’m sure he will never allow that, and neither will the American people.”    The openness to supporting Johnson — and her description of a “productive meeting” last week — mark a sharp change in the pair’s relationship, which has been marked by bitter tension.    Greene’s opposition to Johnson reached a fever pitch in May, when the Georgia Republican brought a motion to vacate against the Speaker, which failed amid opposition from lawmakers in both parties. Only 11 Republicans voted against tabling the measure. Greene had been critical of Johnson for helping move a roughly $61 billion aid package for Ukraine, and supporting the reauthorization of warrantless spying powers.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "fd2e111a-3a10-38c5-8ddb-cd7395cbfa92"
    },
    {
        "title": "Democrats look at late-night, weekend votes to confirm last Biden judicial nominees",
        "link": "https://thehill.com/homenews/senate/4997098-senate-votes-confirm-biden-nominees/",
        "authors": [
            "Alexander Bolton"
        ],
        "date": "Tue, 19 Nov 2024 00:41:31 +0000",
        "summary": "Senate Democrats are expected to vote late into the night Monday in a frantic effort to confirm as many of President Biden’s nominees to the federal judiciary as possible before President-elect Trump takes over in January. Senate Majority Leader Chuck Schumer (D-N.Y.) told colleagues on the Senate floor Monday that the Democratic majority “will keep...",
        "content": "Senate Democrats are expected to vote late into the night Monday in a frantic effort to confirm as many of President Biden’s nominees to the federal judiciary as possible before President-elect Trump takes over in January.    Senate Majority Leader Chuck Schumer (D-N.Y.) told colleagues on the Senate floor Monday that the Democratic majority “will keep working to confirm as many of President Biden’s judicial nominees as we can before the end of the year.”    That means Senate votes stretching late into the night and possibly working over weekends and even during the Christmas recess in late December.    Senators were expecting to hold a series of procedural votes late into Monday night or early Tuesday morning to allow Schumer to file cloture on a batch of Biden nominees, which would set up confirmation votes for later in the week.    Republicans were dragging out the process Monday night by forcing Democrats to hold time-consuming votes on procedural motions to switch from executive to legislative session and back again.    Usually shuttling in between legislative and executive session is a routine move that the minority party agrees to by unanimous consent, without forcing colleagues to show up on the Senate floor to vote for an arcane motion.    Senate staff warned that senators could hold as many as 18 votes Monday night to conduct the procedural business that is often handled with a simple request for unanimous consent.    Schumer asked for unanimous consent at 7:32 pm to limit the length of the procedural votes to 10 minutes.    Republicans confirmed 234 of Trump’s nominees to the federal courts during his four years in office, and so far the Democrat-controlled Senate has confirmed only 216 of Biden’s Article III judicial nominees — at least, as of Monday afternoon.    Senate Judiciary Committee Chair Dick Durbin (D-Ill.) told reporters that holding votes over the weekend and even during parts of the Thanksgiving and Christmas breaks is a possibility.    “I wouldn’t rule those out and Schumer has not ruled them out either,” Durbin said. “I hope that the Republicans will at least be as cooperative with us as we were with them.”    Leading progressive Sen. Elizabeth Warren (D-Mass.) urged Schumer in a Time magazine op-ed to “use every minute of the end-of-the year legislative session to confirm federal judges and key regulators — none of whom can be removed by the next president.\"    The Senate voted at 5:30 p.m. Monday to confirm Embry Kidd of Florida to serve on the U.S. Court of Appeals for the 11th Circuit.    Senators were facing 18 more procedural votes Monday evening to set up cloture votes later in the week on nine more nominees.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "15a19fe5-c681-35db-9a2a-8a0166a1c7f9"
    },
    {
        "title": "House passes major veterans care act",
        "link": "https://thehill.com/policy/defense/4996796-house-passes-major-veterans-care-act/",
        "authors": [
            "Brad Dress"
        ],
        "date": "Tue, 19 Nov 2024 00:26:22 +0000",
        "summary": "The House on Monday passed a massive bill that will fund a range of veterans care services and increase opportunities for retired service members in the workforce and education. The Senator Elizabeth Dole 21st Century Veterans Healthcare and Benefits Improvement Act, known as the Dole Act, passed on a bipartisan 389-9 vote. The bill is...",
        "content": "The House on Monday passed a massive bill that will fund a range of veterans care services and increase opportunities for retired service members in the workforce and education.    The Senator Elizabeth Dole 21st Century Veterans Healthcare and Benefits Improvement Act, known as the Dole Act, passed on a bipartisan 389-9 vote.    The bill is a win for Republicans who have pointed to issues with the Department of Veterans Affairs (VA) and have called to allow veterans to access more care at home.    Rep. Mike Bost (R-Ill.), chair of the House Veterans Affairs Committee, said a big provision is that the VA will no longer \"get to decide where veterans should get their health care.\"    \"The Dole Act would rightfully make sure that a VA bureaucracy cannot veto a doctor's medical decisions,\" he said on the House floor before the vote. \"Two weeks ago, the American people voted us a mandate to fix problems they talked about at their kitchen tables that affect their families and communities every single day. The Dole Act is a foundation for that work to begin with the veterans community.\"    Rep. Jack Bergman (R-Mich.) said it was important to \"ensure that no veteran will have to worry about losing his VA benefits for their family when choosing to spend their last days in the comfort of their home.\"    The bill will next head to the Senate, but it's unclear if there is support for the legislation in the Democratic-controlled chamber.    Rep. Mark Takano (D-Calif.), ranking member of the Veterans Affairs Committee, said the Dole Act will \"connect veterans caregivers to respite care and other support services that help them care for veterans at home,\" calling it \"an investment in care for millions of veterans and current service members.\"    But he also said it was an \"uphill battle\" to get the bill passed, accusing the GOP of \"outsourcing more VA care to for profit health care providers\" in the original bill before a compromise was reached in the past week to preserve VA services.    \"We want VA to remain a strong provider of care, instead of diminishing it to nothing more than an insurance company where profits are prioritized over outcomes for veterans,\" Takano said, adding he supported the bill but was upset about a few provisions.    The Dole Act, named for the former Republican senator from North Carolina, is a major priority for veterans advocacy groups who point to the bill's wide range of funding priorities to improve care through the VA.    The legislation would tackle vexing problems for veterans like housing, offering Native American veterans home projects and purchases on tribal land and authorizing the VA to provide grants for transitional housing for all veterans.    It also bolsters mental health care for veterans, increases coverage for veterans seeking alternatives to nursing home care, funds at-home services, covers ambulance rides to the VA and provides more options for veterans who need a caretaker, among a long list of other health services.    And the bill includes efforts to increase education through expanding scholarship access and modernizing educational assistance tools.     Elizabeth Dole Foundation CEO Steve Schwab said his organization has been working \"for more than a year to pass this transformative legislation for the millions of veterans, caregivers, survivors, and families we serve.\"    Schwab said in a statement he \"will push for swift passage in the Senate to follow so that we can get this to the President’s desk to sign. Our veterans, caregivers, and survivors are depending on us to get this over the finish line.\"    Veterans of Foreign Wars (VFW) also supported the Dole Act this month.    \"This IS a good piece of bipartisan-negotiated legislation that had input from numerous organizations representing veterans, caregivers, and survivors from around the country,\" VFW wrote in a statement.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "d059439c-caec-3049-bd1a-ec2f80e2c0a9"
    },
    {
        "title": "Top Democrat on House Ethics panel says Gaetz report should be released",
        "link": "https://thehill.com/homenews/house/4997080-matt-gaetz-susan-wild-ethics-committee/",
        "authors": [
            "Emily Brooks"
        ],
        "date": "Tue, 19 Nov 2024 00:25:09 +0000",
        "summary": "Rep. Susan Wild (D-Pa.), the top Democrat on the House Ethics Committee, said she thinks the panel’s report on former Rep. Matt Gaetz (R-Fla.) should be released. Wild answered “yes” when asked whether the panel should release its report on Gaetz, who President-elect Trump nominated to be attorney general last week. “We have a scheduled...",
        "content": "Rep. Susan Wild (D-Pa.), the top Democrat on the House Ethics Committee, said she thinks the panel’s report on former Rep. Matt Gaetz (R-Fla.) should be released.    Wild answered “yes” when asked whether the panel should release its report on Gaetz, who President-elect Trump nominated to be attorney general last week.    “We have a scheduled meeting on Wednesday, and it remains to be seen what the chairman's agenda is for that, but I believe we should vote on whether we're to disclose it or not,” Wild said.    Wild, who is leaving Congress at the end of the year after being defeated by Republican challenger Ryan Mackenzie, said that she expected all Democrats to vote in favor of releasing the report. On the evenly split panel with five Republicans and five Democrats, it would take at least one Republican to side with Democrats to vote to release the report.    “Everybody on the committee now has the report, so they've got the opportunity to be reviewing it,” Wild said.    Asked about the possibility of releasing the report only to the Senate, Wild said: “Either you are going to disclose it or you're not going to disclose it.”    Rep. Michael Guest (R-Miss.), the chair of the Ethics Committee, declined to confirm details about the meeting scheduled for Wednesday.    Guest did say that he has read the report on Gaetz, and that other members on the panel “have the ability to read the report.” He declined to offer his thoughts on what the Gaetz report said.    The Ethics Committee investigated Gaetz for years over allegations of sexual misconduct and illicit drug use, among other claims. Gaetz, whom the Justice Department declined to charge after investigating the same matters, has vigorously denied wrongdoing.    Gaetz abruptly resigned from his seat the same day he was announced as Trump's attorney general pick. A source told The Hill that his resignation came just two days before the committee was scheduled to meet to vote to release the report, but that meeting was later canceled.    Speaker Mike Johnson (R-La.) has publicly advocated against releasing the report, since Gaetz is no longer a member of Congress and the committee traditionally does not investigate former members.    “I think that would be a Pandora's box. I don't think we want the House Ethics Committee using all of its vast resources and powers to go after private citizens,” Johnson said Sunday on CNN’s “State of the Union.”    While such a move is very rare, there is precedent for the committee releasing a report after a member resigned. In 1987, the committee released its report on former Rep. William Boner (D-Tenn.) after he resigned from the House.    Senators on both sides of the aisle have said they want to see the report.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "4ac1dce8-9f18-30ff-b452-c27dfcf430c6"
    },
    {
        "title": "Biden's Ukraine missiles decision enrages Russia, riles Trump allies",
        "link": "https://thehill.com/newsletters/defense-national-security/4997030-bidens-ukraine-missiles-decision-enrages-russia-riles-trump-allies/",
        "authors": [
            "Ellen Mitchell"
        ],
        "date": "Mon, 18 Nov 2024 23:46:00 +0000",
        "summary": "Welcome to The Hill's Defense &#038; NatSec newsletter {beacon} Defense &#038;National Security Defense &#038;National Security &#8202; The Big Story  Biden's Ukraine missiles decision enrages Russia, riles Trump allies The Biden administration is apparently calling Russian leader Vladimir Putin’s bluff by allowing Ukraine to strike far into Russian territory with U.S. weapons systems, a move that...",
        "content": " 96&lt;!- --> Welcome to The Hill's Defense & NatSec newsletter{beacon}           Defense &National Security    &lt;!- -->           Defense &National Security    &#8202; The Big Story&nbsp; Biden's Ukraine missiles decision enrages Russia, riles Trump allies  The Biden administration is apparently calling Russian leader Vladimir Putin’s bluff by allowing Ukraine to strike far into Russian territory with U.S. weapons systems, a move that has drawn the ire of President-elect Trump’s allies.&nbsp; © AP The lifting of a restriction on the Army Tactical Missile System (ATACMS) will reportedly apply initially to the Russian region of Kursk, where Ukrainian forces have held territory since an August surprise, and where some 10,000 North Korean troops have been deployed to bolster Russian counter-attacks.&nbsp; &nbsp;Biden officials would not publicly confirm Monday the new policy, but pointed to North Korea’s involvement as an escalation by Moscow.&nbsp;  Prominent figures in Trump’s orbit suggested the move was meant to complicate the incoming president’s push to end the war.&nbsp;&nbsp; Rep. Mike Waltz (R-Fla.), Trump’s pick for national security adviser,&nbsp;told Fox News on Monday&nbsp;that Biden’s ATACMS lift is “another step up the escalation ladder.” &nbsp;“And nobody knows where this is going,” he said. “Trump is talking grand strategy here. How do we get both sides to the table to end this war, what’s the framework for the deal, and who’s sitting at that table.” &nbsp; “The Military Industrial Complex seems to want to make sure they get World War 3 going before my father has a chance to create peace and save lives,” Donald Trump Jr.&nbsp;wrote on X Sunday, responding to reports about the policy change.&nbsp;&nbsp; The Kremlin on Monday accused Biden of adding “fuel to the fire” in Ukraine, and pointed to previous remarks from Putin, who warned in September that any nuclear-armed nation approving the use of such missiles in Russia would be declaring war with his country.&nbsp;&nbsp;“This would in a significant way change the very nature of the conflict,” Putin said in September.&nbsp;&nbsp; Pentagon deputy press secretary Sabrina Singh dismissed concerns of escalation, pointing to North Korean troop deployments as already a major increase in hostilities.&nbsp;&nbsp; “North Korea entering this war makes them co-belligerents with Russia, and we’re talking about North Korean soldiers being used to take sovereign territory, Ukraine’s sovereign territory,” she told reporters in a Monday briefing.&nbsp;&nbsp; ATACMS are long-range missiles that can be fired from systems like the High Mobility Artillery Rocket System (HIMARS) and reach targets up to 190 miles away.&nbsp; They are much more accurate and lethal than the long-range drones that Ukraine has used to target deep into Russia.&nbsp;&nbsp; Read the full report at TheHill.com.&#8202; Welcome to The Hill’s Defense & National Security newsletter, I'm Ellen Mitchell — your guide to the latest developments at the Pentagon, on Capitol Hill and beyond.&#8202; Did someone forward you this newsletter? Subscribe here. &#8202; Essential Reads&nbsp; How policy will affect defense and national security now and inthe future:&#8202; Top House Democrat: Gabbard ‘a national security threat’ to US Rep.&nbsp;Gregory Meeks&nbsp;(D-N.Y.), the ranking member on the House Foreign Affairs Committee, said Monday that former Democratic Rep.&nbsp;Tulsi Gabbard&nbsp;(Hawaii), now a Republican and President-elect Trump’s&nbsp;pick for director of national intelligence, is “a national security threat” to the United States.      &nbsp;Full Story &#8202; Trump signals use of military for deportationsPresident-elect Trump recirculated a social media post Monday suggesting his incoming administration will declare an immigration national emergency and use military assets to support his mass deportation pledge, labeling the claim “TRUE!!!” On his Truth Social site, Trump at 4:03 a.m. EST reposted Tom Fitton, the president of Judicial Watch, a conservative organization that&#8217;s been active both in courts and on social media&nbsp;…      &nbsp;Full Story &#8202;Trump Jr.: Biden administration trying to cause ‘World War 3’ by helping UkraineDonald Trump Jr., the eldest son of President-elect Trump, claimed the Biden administration is trying to cause “World War 3” by helping Ukraine in its war with Russia. “The Military Industrial Complex seems to want to make sure they get World War 3 going before my father has a chance to create peace and save lives,” Trump Jr. posted on the social platform X. “Gotta lock in those $Trillions. Life be dammed!!! Imbeciles!” He&nbsp;…      &nbsp;Full Story &#8202;Russia: US adding ‘fuel to the fire’ with Ukraine missiles decision The Kremlin on Monday issued an angry response to a reported U.S. decision to allow Ukraine to use Western-provided missiles to strike deep into Russian territory, accusing Washington of adding “fuel to the fire” in a war Moscow launched almost three years ago.&nbsp; Kremlin spokesperson Dmitry Peskov reportedly said it marked a “qualitative increase in the level of” U.S. involvement in what Moscow calls a special military&nbsp;…      &nbsp;Full Story &#8202;  On Our Radar&nbsp; Upcoming things we're watching on our beat:&nbsp; Defense Secretary&nbsp;Lloyd Austin was in the Philippines yesterday to meet with President Bongbong Marcos ahead of traveling on to Laos and Fiji. DHS Secretary&nbsp;Alejandro Mayorkas, FBI Director&nbsp;Christopher Wray, and&nbsp;&nbsp;Bret Holmgren, acting director, National Counterterrorism Center, will&nbsp;testify Wednesday on worldwide threats before the House Committee on Homeland Security and again Thursday before the Senate Homeland Security and Governmental Affairs Committee on Thursday. &#8202; In Other News&nbsp; Branch out with a different read from The Hill: Neo-Nazi march in Ohio draws rebuke COLUMBUS, Ohio (WCMH) — President&nbsp;Joe Biden&nbsp;joined the chorus of state and city officials who are condemning a&nbsp;weekend neo-Nazi march in Columbus, Ohio.&nbsp;      Full Story &#8202;  On Tap Tomorrow&nbsp; Events in and around the defense world:&nbsp; A Senate Judiciary subpanel will hold a hearing on “China’s cybersecurity threat,” at 2 p.m. The U.S. Helsinki Commission will hold a hearing on“1000 Days of Russia’s War on Ukraine,” with testimony from Ukrainian Foreign Minister Andrii Sybiha, at 2:30 p.m.&nbsp; The Senate Armed Services emerging threats and capabilities subcommittee will hold a hearing on the “Activities of the All-domain Anomaly Resolution Office,” at 4:30 p.m.&#8202; What We're Reading&nbsp; News we've flagged from other outlets: Second Trump presidency could mean harder line with defense industry (Military Times) North Korea may end up sending Putin 100,000 troops for his war (Bloomberg)&#8202; Trending Today&nbsp; Two key stories on The Hill right now: The Trump administration’s next target: naturalized US citizens  Even “documented” immigrants will not be safe, because Miller has declared that he will pursue the seldom-used process of “denaturalization” to go&nbsp;… Read more Pennsylvania Supreme Court rebukes Democratic election officials who counted undated mail ballots The Pennsylvania Supreme Court on Monday&nbsp;rebuked Democratic-controlled elections boards that counted undated and misdated mail ballots, siding&nbsp;… Read more&#8202; Opinions in The Hill&nbsp;Op-eds related to defense & national security submitted to The Hill: Trump, the self-proclaimed peacemaker, should channel and exceed his inner Reagan How Trump can continue to realign the Middle East in his second term Trump will make peace through strength great again&#8202;&#8202;You're all caught up. See you tomorrow!&nbsp;        Close                           Thank you for signing up!      Subscribe to more newsletters here                                            The latest in politics and policy. Direct to your inbox. Sign up for the Defense and National Security newsletter                                                                                                                                                               Subscribe                                 ",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "4f228452-d50d-3af1-a49b-df6b593df6b4"
    },
    {
        "title": "Trump picks ex-GOP Rep. Sean Duffy for Transportation secretary",
        "link": "https://thehill.com/homenews/administration/4997023-trump-picks-ex-gop-rep-sean-duffy-for-transportation-secretary/",
        "authors": [
            "Tara Suter"
        ],
        "date": "Mon, 18 Nov 2024 23:36:10 +0000",
        "summary": "President-elect Trump said Monday that his selection for the role of Transportation secretary in his upcoming administration is former Rep. and Fox Business host Sean Duffy (R-Wis.). “I am pleased to announce that former Congressman Sean Duffy, from the Great State of Wisconsin, is nominated to serve as the Secretary of Transportation,” Trump said in...",
        "content": "President-elect Trump said Monday that his selection for the role of Transportation secretary in his upcoming administration is former Rep. and Fox Business host Sean Duffy (R-Wis.).    “I am pleased to announce that former Congressman Sean Duffy, from the Great State of Wisconsin, is nominated to serve as the Secretary of Transportation,” Trump said in a statement. “Sean has been a tremendous and well-liked public servant, starting his career as a District Attorney for Ashland, Wisconsin, and later elected to the U.S. House of Representatives for Wisconsin's 7th Congressional District.”    Duffy left the House in late 2019 in the wake of learning that one of his children had a heart condition. He has historically been a supporter of the president-elect, defending Trump’s controversial 2017 executive order on immigration imposing a 90-day ban on nationals from seven mostly Muslim countries from coming into the U.S.    “What’s wrong with a pause? We’ve having a pause for 90 days. Why is that so radical?” Duffy said on CNN’s “New Day” at the time.    In his Monday statement, Trump said Duffy “was a respected voice and communicator in the Republican Conference, advocating for Fiscal Responsibility, Economic Growth, and Rural Development” while “in Congress.”    Trump also urged Duffy to run for Wisconsin governor in 2022, saying he was trying “hard to get very popular and capable Former Congressman Sean Duffy of Wisconsin to run for Governor” in late 2021.    Duffy said later in early 2022 that he would not run for the Badger State’s top office.    “Hopefully I’m not riding off into the sunset,” Duffy said on 1130 WISN, a talk radio station. “I’m just running into the sunset right now. If an opportunity presents itself, I’d like to come back and partake in Wisconsin politics.”    Duffy currently co-hosts a show on Fox Business in its 6 p.m. hour called \"The Bottom Line.\" He has been a contributor to the network since 2020.&nbsp;    The former GOP congressman is married to fellow Fox host Rachel Campos Duffy, whom he met on a reality television show. She serves as a co-host for \"Fox &amp; Friends Weekend.\"&nbsp;    Campos Duffy is a former co-host of Pete Hegseth, Trump's pick for Defense secretary, while Sean Duffy is the fourth current or former Fox host to be tapped for a position in the president-elect's administration.&nbsp;    In a statement to The Hill, Fox confirmed Duffy's employment at the network ended with his being selected by Trump on Monday.&nbsp;    “Sean Duffy provided valuable insights and analysis in co-hosting the FOX Business Network program, The Bottom&nbsp;Line,\" the network said. \"As Duffy departs FOX News Media effective today, we wish him the best of luck in his return to Washington. Moving forward,&nbsp;The Bottom Line&nbsp;will continue with Dagen McDowell joined by rotating co-hosts.”    Dominick Mastrangelo contributed.    Updated at 7:44 pm EST.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "25a469d7-e367-3f8b-982b-60ccabc806fa"
    },
    {
        "title": "Mace introduces bill to bar trans women from Capitol restrooms",
        "link": "https://thehill.com/homenews/house/4997024-mace-introduces-bill-transgender/",
        "authors": [
            "Brooke Migdon",
            "Mychael Schnell"
        ],
        "date": "Mon, 18 Nov 2024 23:36:01 +0000",
        "summary": "Rep. Nancy Mace (R-S.C.) on Monday introduced a bill to bar transgender women from facilities on Capitol Hill that match their gender identity. The resolution, which would prohibit members, officers and employees of the House from using single-sex facilities that correspond to their gender identity, comes just a week after Rep.-elect Sarah McBride (D-Del.) made history as...",
        "content": "Rep. Nancy Mace (R-S.C.) on Monday introduced a bill to bar transgender women from facilities on Capitol Hill that match their gender identity.    The resolution, which would prohibit members, officers and employees of the House from using single-sex facilities that correspond to their gender identity, comes just a week after Rep.-elect Sarah McBride (D-Del.) made history as the first openly transgender person elected to Congress.    The measure charges the House sergeant-at-arms, William McFarland, with enforcing the ban, according to text previewed by The Hill, but it is unclear how the House’s chief law enforcement officer will determine who can and cannot use the Capitol’s facilities.    State laws that bar transgender people from using public restrooms that match their gender identity often rely on anonymous complaints, a notoriously unreliable enforcement mechanism. LGBTQ rights activists in May flooded a tip line designed to alert officials in Utah to possible violations of the state’s bathroom ban with thousands of false complaints.    \"This is a blatant attempt from far right-wing extremists to distract from the fact that they have no real solutions to what Americans are facing,\" McBride said in a statement. \"We should be focused on bringing down the cost of housing, health care and child care, not manufacturing culture wars.\"    \"Delawareans sent me here to make the American dream more affordable and accessible and that's what I'm focused on,\" she said.    Mace is currently in talks with leadership regarding how to bring the measure to the floor, a source familiar with the matter told The Hill.    The congresswoman initially planned to call her legislation to the floor as a privileged resolution on Monday evening, the source said, a gambit that would have forced leadership to stage a vote on the measure within two legislative days.    But Mace scrapped those plans because of ongoing negotiations with leadership regarding the best way to pass the legislation, the source said. Mace is pushing for the measure to be included in the rules package for the 119th Congress, or for it to be brought to the floor and voted on as a stand-alone rule outside the package.    If the bill, however, is not included in the 119th Congress rules package or brought to the floor as a stand-alone rule, Mace would force a vote on the legislation, the source said.    The House is set to vote on a rules package for the next Congress in early January, which will require a majority vote for passage. Republicans are poised to have a razor-thin majority when the next session gavels in.    Updated at 7:13 pm EST.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "026c7d4b-0934-3279-a183-926fdeec8889"
    },
    {
        "title": "Fewer employees say they are thriving: Gallup",
        "link": "https://thehill.com/blogs/blog-briefing-room/news/4996879-fewer-employees-say-they-are-thriving-gallup/",
        "authors": [
            "Joanne Haner"
        ],
        "date": "Mon, 18 Nov 2024 23:28:57 +0000",
        "summary": "Fewer employees say they're thriving, according to Gallup's most recent Life Evaluation Index. Fifty percent of employees say they are thriving, while 45 percent say they are struggling. An additional 4 percent say they are suffering. After a steady decline since 2020, this 2024 number marks a record low thriving rate since Gallup created the...",
        "content": "Fewer employees say they're thriving, according to Gallup's most recent Life Evaluation Index.    Fifty percent of employees say they are thriving, while 45 percent say they are struggling. An additional 4 percent say they are suffering. After a steady decline since 2020, this 2024 number marks a record low thriving rate since Gallup created the index in 2009. &nbsp;    The Gallup Life Evaluation Index measures how people rate their current and expected future lives. Respondents who respond \"thriving\" have positive views of their current and immediate futures. They report significantly fewer health problems, fewer negative emotions like worry and stress, and more positive emotions like happiness and energy.&nbsp;    Similarly, 51 percent of respondents said they experience stress \"a lot\" during the day, up from 49 percent in 2023. Eighteen percent of respondents said the same about anger.      Gallup also found that workers who are not thriving in their life experience higher amounts of worry, anger and employee burnout. Twenty-eight percent of U.S. employees already said they \"very often or always\" feel burned out at work.    Engaged employees who are not “thriving” are 61 percent more likely to experience burnout often or always and have double the rates of sadness and anger. Meanwhile, thriving employees miss 53 percent fewer days due to health issues. An August Gallup poll also revealed that only 37 percent of employees feel respected at work, down from 39 percent in May.     The Gallup poll, conducted Aug. 11-25, included 10,570 full-time workers and had a margin of error of 1.2 percentage points.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "26fc2f00-2a1c-393b-ba95-4a0db8701fe0"
    },
    {
        "title": "Georgia appeals court cancels arguments in Trump's bid to disqualify Fani Willis",
        "link": "https://thehill.com/regulation/court-battles/4996911-fani-willis-trumo-georgia-appeal-cancelled/",
        "authors": [
            "Zach Schonfeld"
        ],
        "date": "Mon, 18 Nov 2024 23:11:10 +0000",
        "summary": "A Georgia appeals court canceled next month’s oral arguments in President-elect Trump’s bid to disqualify Fulton County District Attorney Fani Willis (D) from criminally prosecuting him.  Monday's one-sentence order from the Georgia Court of Appeals canceling the Dec. 5 argument “until further order of this Court” contained no explanation but comes less than two weeks...",
        "content": "A Georgia appeals court canceled next month’s oral arguments in President-elect Trump’s bid to disqualify Fulton County District Attorney Fani Willis (D) from criminally prosecuting him.&nbsp;    Monday's one-sentence order from the Georgia Court of Appeals canceling the Dec. 5 argument “until further order of this Court” contained no explanation but comes less than two weeks after Trump’s White House victory.&nbsp;    Earlier this year, Trump began attempting to derail his criminal prosecution for attempting to overturn his election loss in Georgia in 2020 over Willis’s relationship with a top prosecutor she hired to oversee the case, Nathan Wade.    After a whirlwind hearing earlier this year, the trial judge ruled the case could move forward and that Willis could continue to oversee the prosecution so long as Wade resigned, which he did.&nbsp;    The appeals court was slated to hear arguments from Trump and eight of his co-defendants that Willis cannot oversee the prosecution.    Willis indicted the former president and more than a dozen of his allies on racketeering and other charges for allegedly entering a months-long, unlawful conspiracy to overturn Trump’s 2020 loss in Georgia, one of four criminal cases brought against the former president.    Trump’s legal team believes all his criminal prosecutions must be dismantled now that he is president-elect, but his attorneys hadn’t yet formally mounted such an effort in the Georgia case.&nbsp;    The appeals court could still issue its ruling without hearing arguments, but before the election, it agreed to hold them at Trump’s request.&nbsp;    The Hill has reached out to Willis’s office and Trump’s attorney for comment.&nbsp;    Monday’s cancellation is the last of Trump’s four criminal cases to be halted following his White House victory.&nbsp;    Courts have put on hold special counsel Jack Smith’s federal election interference case in the nation’s capital and his appeal in the documents case in Florida. Smith is assessing how to wind down the prosecutions before Trump's inauguration and is due to provide an update by Dec. 2.    In New York, Trump’s judge overseeing his hush money criminal case has temporarily frozen it until Manhattan District Attorney Alvin Bragg (D) proposes next steps by Tuesday. Legal observers largely expect next week’s sentencing to be cancelled.&nbsp;",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "773e9983-5acb-35b2-a1bc-ebb45e169963"
    },
    {
        "title": "Trump's Treasury pick search",
        "link": "https://thehill.com/newsletters/business-economy/4996961-trumps-treasury-pick-search/",
        "authors": [
            "Aris Folley",
            "Taylor Giorno"
        ],
        "date": "Mon, 18 Nov 2024 23:05:58 +0000",
        "summary": "Welcome to The Hill's Business &#038; Economy newsletter {beacon} Business &#038; Economy Business &#038; Economy &#8202; The Big Story  Trump mulls new Treasury options, Commerce pick President-elect Trump is expanding his search for a Treasury secretary as jockeying to fill the key economic role has spilled into public view. © AP Photo/Alex Brandon In recent...",
        "content": "96        Welcome to The Hill's Business & Economy newsletter {beacon}                                                   Business & Economy                      Business & Economy                         &#8202;                       The Big Story&nbsp;         Trump mulls new Treasury options, Commerce pick          President-elect Trump is expanding his search for a Treasury secretary as jockeying to fill the key economic role has spilled into public view.                     © AP Photo/Alex Brandon           In recent weeks, it appeared investor Scott Bessent was the front-runner for the role. &nbsp;  But while he has visited Mar-a-Lago multiple times in recent weeks, billionaire Elon Musk, Trump's \"buddy in chief,\" advocated over the weekend for Howard Lutnick, the Cantor Fitzgerald head who is co-leading Trump’s transition team. The search has since expanded. Trump is also considering Apollo Global Management co-founder Marc Rowan and former Federal Reserve governor Kevin Warsh for the job, a source close to the transition confirmed to The Hill. Whoever the president-elect picks will be tasked with implementing key campaign promises including extending tax cuts set to expire next year and imposing tariffs on imports, a central to Trump's economic pitch to voters despite concerns from economists. “All these guys will be OK with tax cuts and reassuring the markets,” said one source close to the transition. “But he wants somebody that is a true believer in what he thinks on tariffs, and…there’s no proof for these people being pro-tariff 18 months ago or 36 months ago.” The Treasury secretary contest had largely played out behind closed doors until this weekend, when Musk posted on X that Bessent would be a “business-as-usual” choice. &nbsp; “Business-as-usual is driving America bankrupt, so we need change one way or another,” Musk wrote, encouraging others to weigh in with their opinions.  The Hill's Brett Samuels has more here.            &#8202;             Welcome to The Hill’s Business & Economy newsletter, we’re Aris Folley&nbsp;and Taylor Giorno — covering the intersection of Wall Street and Pennsylvania Avenue.             &#8202;             Did someone forward you this newsletter? Subscribe here.                      &#8202;                       Essential Reads&nbsp;            Key business and economic news with implications this week and beyond:                            &#8202;            5 things to know about Trump’s FCC pick                             President-elect Trump has tapped Brendan Carr to be the next chair of the Federal Communications Commission (FCC), teeing the agency up for a likely clash with Big Tech and media companies he has accused of “censoring” conservative views. &nbsp;               &nbsp;Full Story                                         &#8202;            Plastic bag bans can sometimes backfire: Study                            Policies aimed at curbing the use of single-use plastic bags have sometimes accomplished the opposite of their intentions, a new study has found.               &nbsp;Full Story                                         &#8202;            DC lobbying giant adds Florida firepower                             An influential Florida lobbyist is joining one of Washington’s biggest lobbying firms, a powerful addition as the Sunshine State is poised to play an outsized role in the incoming Trump administration.               &nbsp;Full Story                                   &#8202;                       The Ticker&nbsp;            Upcoming news themes and events we're watching:            The&nbsp;Senate Judiciary Committee holds a hearing on breaking up the \"Visa-Mastercard duopoly\" Tuesday at 10 a.m. ET.                      &#8202;                      In Other News&nbsp;           Branch out with more stories from the day:                                     US to add features such as blind spot warnings and pedestrian detection to vehicle crash ratings           DETROIT (AP) — The U.S. government&#8217;s automobile safety ratings will get a major update starting&nbsp;…               Full Story                     &#8202;                       Good to Know&nbsp;            Business and economic news we've flagged from other outlets:            NBA, Warner Bros. Discovery agree to settle lawsuit over live game rights (CNBC)  Brendan Carr wrote the FCC chapter in ‘Project 2025.’ Now he’s Trump’s pick for the agency (CNN)  How Kamala Harris Burned Through $1.5 Billion in 15 Weeks (The New York Times)                      &#8202;                       What Others are Reading&nbsp;            Top stories on The Hill right now:                                     The Trump administration’s next target: naturalized US citizens             It appears that President-elect Donald Trump intends to keep his campaign&nbsp;promise&nbsp;to begin deporting at least 15 million people who, he claims, have been “poisoning the blood” of our country. By at least one&nbsp;estimate, it will be virtually impossible — logistically and financially —&nbsp;… Read more                       Pennsylvania Supreme Court rebukes Democratic election officials who counted undated mail ballots            The Pennsylvania Supreme Court on Monday&nbsp;rebuked Democratic-controlled elections boards that counted undated and misdated mail ballots, siding with Republicans and reiterating that such votes are invalid.&nbsp; Read more                      &#8202;                       What People Think&nbsp;            Opinion related to business and economic issues submitted to The Hill:            Government fraud is America’s biggest scam. Stopping it is key to our future.                       &#8202;                 &#8202;                You're all caught up. See you tomorrow!&nbsp;           Close                           Thank you for signing up!      Subscribe to more newsletters here                                            The latest in politics and policy. Direct to your inbox. Sign up for the Business and Economy newsletter                                                                                                                                                               Subscribe                                 ",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "9d7965df-2d8b-36ed-bb21-636fddf8215a"
    },
    {
        "title": "Ethics panel chair: Johnson won't influence whether Gaetz report released",
        "link": "https://thehill.com/homenews/house/4996888-gaetz-report-release-johnson-influence/",
        "authors": [
            "Tara Suter"
        ],
        "date": "Mon, 18 Nov 2024 23:04:42 +0000",
        "summary": "Rep. Michael Guest (R-Miss.), the chair of the House Ethics Committee, said that House Speaker Mike Johnson (R-La.) won’t influence whether his committee releases its report on former Rep. Matt Gaetz (R-Fla.), who vacated his House seat last week after being tapped to become President-elect Trump's attorney general. Johnson has urged the Ethics Committee against...",
        "content": "Rep. Michael Guest (R-Miss.), the chair of the House Ethics Committee, said that House Speaker Mike Johnson (R-La.) won’t influence whether his committee releases its report on former Rep. Matt Gaetz (R-Fla.), who vacated his House seat last week after being tapped to become President-elect Trump's attorney general.    Johnson has urged the Ethics Committee against releasing the Gaetz report, saying it would be “a terrible breach of protocol and tradition and the spirit of the rule,” since Gaetz is no longer a House member.     Guest said Monday that he and Johnson spoke at the end of last week, according to Politico.    “I appreciate Mike reaching out,” Guest told the outlet. “I don't see it having an impact on what we as a committee ultimately decide.”    While Trump has nominated a number of controversial figures to his Cabinet, none has garnered more blowback than Gaetz, a far-right firebrand and fierce Trump loyalist.     At the Department of Justice, he would take over an agency that previously investigated him over allegations of sex trafficking. Though that probe did not lead to charges, the House Ethics Committee opened its own investigation into accusations of sexual misconduct and illicit drug use. Gaetz has denied allegations of wrongdoing.    Two women testified before the House Ethics Committee that Gaetz paid them to have sex, according to the attorney representing them.    Democrats and some Republicans have said the findings in the report must be released to senators weighing his nomination.     The Ethics Committee pushed back a meeting last week about the report, and is now set to meet Wednesday about it, a source told The Hill. Guest told Politico the report is not available to all members of the committee.    Johnson has quickly found his way into Trump's inner orbit following this month's election victory, and is trying to exert his influence to block the Gaetz report.     “I’m going to strongly request the Ethics Committee not issue the report, because that is not how we do things in the House and I think that would be a terrible precedent to set,” he told reporters on Friday.    In an interview on CNN’s “State of the Union” on Sunday, Johnson said he had not spoken with Trump about the report.    “The president and I have literally not discussed one word about the ethics report, not once, and I’ve been with him quite a bit this week — between Washington and Mar-a-Lago and last night at Madison Square Garden,” Johnson said. ",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "1ef670b6-3563-339e-a7df-e686c5905df7"
    },
    {
        "title": "32 state attorneys general call on Congress to pass Kids Online Safety Act",
        "link": "https://thehill.com/policy/technology/4996830-32-state-attorneys-general-call-on-congress-to-pass-kids-online-safety-act/",
        "authors": [
            "Miranda Nazzaro"
        ],
        "date": "Mon, 18 Nov 2024 23:00:00 +0000",
        "summary": "A bipartisan coalition of more than 30 attorney generals is urging Congress to pass the Kids Online Safety Act (KOSA) this year, stating the legislation will “establish better safeguards for minors online.”   In a letter sent to leadership offices in the House and Senate, the 32 attorneys general said they are concerned about the...",
        "content": "A bipartisan coalition of more than 30 attorney generals is urging Congress to pass the Kids Online Safety Act (KOSA) this year, stating the legislation will “establish better safeguards for minors online.” &nbsp;    In a letter sent to leadership offices in the House and Senate, the 32 attorneys general said they are concerned about the negative impacts “prolific internet usage” has on children.      “We are acutely aware of the threats minors face on social media. Many social media platforms target minors, resulting in a national youth mental health catastrophe,” the letter, led by Tennessee Attorney General Jonathan Skrmetti (R), stated. &nbsp;    “These platforms make their products addictive to minor users, and then profit from selling minor user data to advertisers,” the letter continued. “These platforms fail to disclose the addicting nature of their products, nor the harms associated with increased social media use. Instead, minor users receive endless tailored and toxic content.”&nbsp;    The letter comes as KOSA faces an uncertain future in the House, where leadership has expressed concerns the bill would censor conservative voices or overstep authority. &nbsp;    KOSA, which passed the Senate in a 91-3 vote last summer, is intended to boost online privacy and safety for children. It would create regulations for the kinds of features tech and social media companies offer kids online and aims to reduce the addictive nature and mental health impact of these platforms. &nbsp;    To make their case for KOSA, the attorneys general pointed to the investigations and lawsuits led by many of their offices against Meta and TikTok for alleged harm to minors. &nbsp;    More than a dozen states and the District of Columbia filed suit against TikTok last month, alleging the platform exploits and harms young users and “deceives” the public about these dangers. &nbsp;    Meta, the parent company of Facebook and Instagram, is similarly facing state-led suits accusing the tech giant of knowingly designing and deploying harmful features on its platforms. &nbsp;    The attorneys general said congressional passage of KOSA will aid state-level efforts by mandating social media platforms have the strongest safety settings by default and allowing kids and their parents or guardians to opt out of the “most addictive product features” and algorithmic recommendations. &nbsp;    The bill would also give parents new controls to “support their children and identify harmful behaviors,” and improve their reporting abilities, the state leaders noted.&nbsp;    “This is a great improvement over the earlier version that did not provide for state enforcement. The states have been consistently acting to vigorously protect kids from online dangers using their existing consumer protection authority, and we look forward to further collaboration,” the letter wrote. &nbsp;    New York Attorney General Letitia James (D), one of the signatories, emphasized KOSA will help states introduce more safeguards when necessary. &nbsp;    “With KOSA, we can establish a foundation of protections for kids nationwide, but we must also ensure states are empowered to introduce more expansive safeguards for their kids as needed,” she said in a release Monday. “Taking on addictive social media is not a partisan issue – it’s about protecting kids and ensuring that government is able to act effectively at all levels.”&nbsp;    James helped push a state bill to limit \"addictive\" social media feeds for kids past the finish line last summer, and is overseeing the rulemaking process for the law to take effect.    While&nbsp;the bill advanced out of the House Energy and Commerce Committee last month, there are only weeks remaining in the lame-duck session and members in both parties have expressed issues with its language, for varied reasons. &nbsp;    House Speaker Mike Johnson (R-La.) told Punchbowl News&nbsp; last month he likes the concept of KOSA, though the details of the Senate-passed version are “very problematic.” &nbsp;    Meanwhile, some lawmakers were concerned with the language of KOSA’s “duty of care” provision. As written in the Senate version, the provision would require platforms to design and implement features for minors to prevent and reduce harm, such as those caused by content promoting suicide and eating disorders.&nbsp;    The House version that advanced out of committee last month included amendments changing this provision.&nbsp;",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "22501490-af58-3ffc-97a3-5f5bc3f12722"
    },
    {
        "title": "Health care advocates prepare to fight RFK Jr. nomination",
        "link": "https://thehill.com/newsletters/health-care/4996953-health-care-advocates-prepare-to-fight-rfk-jr-nomination/",
        "authors": [
            "Nathaniel Weixel",
            "Joseph Choi",
            "Alejandra O&#039;Connell-Domenech"
        ],
        "date": "Mon, 18 Nov 2024 22:59:27 +0000",
        "summary": "Click in for more news from The Hill {beacon} Health Care Health Care &#8202; The Big Story  Health advocates launch effort to bar RFK Jr. nomination Democratic-aligned health advocacy groups are organizing an effort to fight the nomination of Robert F. Kennedy Jr. to lead the Department of Health and Human Services.  © AP Protect...",
        "content": " 96&lt;!- --> Click in for more news from The Hill{beacon}           Health Care    &lt;!- -->           Health Care    &#8202; The Big Story&nbsp;Health advocates launch effort to bar RFK Jr. nominationDemocratic-aligned health advocacy groups are organizing an effort to fight the nomination of Robert F. Kennedy Jr. to lead the Department of Health and Human Services.&nbsp;© AP Protect Our Care held an organizing call Monday for the “Stop RFK War Room” with more than 200 people in attendance representing dozens of groups interested in pushing back against Kennedy and his potential confirmation, the group’s executive director Brad Woodhouse told The Hill. &nbsp; Protect Our Care has been a leading voice among Democratic circles to fight against&nbsp;GOP-led cuts to Medicaid, Medicare, the Affordable Care Act and the Inflation Reduction Act. &nbsp;&nbsp; Woodhouse said the group has priorities it is pushing for in the congressional lame duck session — like the extension of ObamaCare subsidies — but the speed at which President-elect Trump is moving on his nominations means fighting Kennedy is now the top order of business. &nbsp;&nbsp; He challenged the assumption that GOP control of the Senate will mean an automatic confirmation.&nbsp; &nbsp;&nbsp; “We're adding this [fight] because, I mean, at the end of the day, [Kennedy] being in a place where his voice carries more weight than it does today... is dangerous and will put people's lives at risk,” Woodhouse said. &nbsp;&nbsp; Woodhouse said the groups on the call discussed the Republican senators to target and the best way to message it — which is not to “beat up” the other side. &nbsp;&nbsp; They’ve already hired lobbying teams targeting the home states of key GOP senators — moderate Susan Collins of Maine and Lisa Murkowski of Alaska; Dan Sullivan of Alaska who is up for reelection in 2026; Mike Crapo of Idaho, who is the likely chairman of the Senate Finance Committee; Thom Tillis of North Carolina, who is up for reelection in 2026 and has an uneasy relationship with the MAGA wing of the party; and current Senate Minority Leader Mitch McConnell of Kentucky, who Woodhouse said is a perfect advocate for vaccines&nbsp;and health research&nbsp;because he survived polio.&nbsp; &nbsp;Woodhouse said state-level events will begin next week. They want to highlight some of the top threats that Kennedy poses to healthcare and to public health. &nbsp;&#8202;  Welcome to The Hill’s Health Care newsletter, we’re Nathaniel Weixel, Joseph Choi and Alejandra O'Connell-Domenech — every week we follow the latest moves on how Washington impacts your health. &#8202; Did someone forward you this newsletter? Subscribe here. &#8202;Essential Reads&nbsp;How policy will be impacting the health care sector this week and beyond:&#8202; Trump’s former CDC Director Redfield defends RFK Jr. pickRobert Redfield, former director of the Centers for Disease Control and Prevention (CDC) under the first Trump administration, gave a vote of confidence to Robert F. Kennedy Jr. as potential head of the Department of Health and Human Services (HHS). NewsNation&#8217;s Brian Entin asked Redfield on Sunday whether there should be concerns that Kennedy, a well-known opponent of vaccines, will introduce a &#8220;no-vaccine culture&#8221;&nbsp;…      &nbsp;Full Story &#8202;Public health leader: RFK Jr. ‘fails on all fronts’ as potential agency leaderA leading public health organization is sounding the alarm over Robert F. Kennedy Jr., President-elect Trump’s pick to lead the Department of Health and Human Services.  The American Public Health Association (APHA) said Kennedy “fails on all fronts” as a candidate to lead the nation’s top health agency.&nbsp; “We urge President-elect Trump to select a qualified health leader that is properly trained and has the management&nbsp;…      &nbsp;Full Story &#8202;Senate GOP gives RFK Jr. pick relatively warm reception President-elect Trump’s pick of Robert F. Kennedy Jr. to lead the Department of Health and Human Services (HHS) set off immediate alarm among Democrats and public health experts, but so far the reception among key Senate Republicans has ranged from enthusiastic to open-minded. Kennedy is a prominent vaccine skeptic who argues the rise of chronic diseases in America can be traced to ultra-processed foods, environmental toxins&nbsp;…      &nbsp;Full Story &#8202; On Our Radar&nbsp;Upcoming news themes and events we're watching: A House Appropriations subcommittee will hold a Tuesday hearing on the National Institutes of Health. A House Judiciary subcommittee will hold a hearing Thursday on oversight of the Department of Health and Human Services' Office of Refugee Resettlement.&#8202;In Other News&nbsp;Branch out with a different read: Democrats wrestle over role of transgender rights in election Democrats are wrestling with the role the party’s broad support for transgender rights played in its failure to capture the presidency and either chamber of Congress, with sharp views being exchanged in a party reeling from its losses.&nbsp;      Full Story &#8202; Around the Nation&nbsp;Local and state headlines on health care: Bird flu kills more than half of WA tern colony (The Seattle Times)&nbsp; Massachusetts’ big economic development bill also seeks to improve local health authorities (Worcester Telegram & Gazette)&nbsp; An Idaho regional health department banned COVID vaccines. Will others follow? (Salon)&nbsp;&#8202;What We're Reading&nbsp;Health news we've flagged from other outlets: More kindergarteners are getting vaccine exemptions (Axios)&nbsp; Lilly pill cuts genetic form of cholesterol nearly 86 percent in study (Reuters)&nbsp; Nomination of RFK Jr reflects a broader shake-up in the politics of health (The Christian Science Monitor)&nbsp;&#8202;What Others are Reading&nbsp; Most read stories on The Hill right now: The Trump administration’s next target: naturalized US citizens  It appears that President-elect Donald Trump intends to keep his campaign&nbsp;promise&nbsp;to begin deporting at least 15 million people who, he claims,&nbsp;… Read more Pennsylvania Supreme Court rebukes Democratic election officials who counted undated mail ballots The Pennsylvania Supreme Court on Monday&nbsp;rebuked Democratic-controlled elections boards that counted undated and misdated mail ballots, siding&nbsp;… Read more&#8202;What People Think&nbsp;Opinions related to health submitted to The Hill: A right to life, but not to die — it’s not just women’s bodies MAGA wants to control RFK Jr. is poised to save the health and lives of millions of Americans &#8202;&#8202;You're all caught up. See you tomorrow!&nbsp;        Close                           Thank you for signing up!      Subscribe to more newsletters here                                            The latest in politics and policy. Direct to your inbox. Sign up for the Health Care newsletter                                                                                                                                                               Subscribe                                 ",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "454301a2-5af2-3570-b528-7ce0510cc220"
    }
]