[
    {
        "title": "Trump watches as Musk's SpaceX launches Starship rocket",
        "link": "https://thehill.com/policy/technology/4998878-trump-musk-spacex-launches-starship/",
        "authors": [
            "Brett Samuels"
        ],
        "date": "Tue, 19 Nov 2024 22:29:18 +0000",
        "summary": "President-elect Trump joined Elon Musk on Tuesday in Texas to observe the launch of a SpaceX rocket as the two leaders have spent significant time together since Election Day. Trump was joined by some of his staff and Republican lawmakers, including Sens. Ted Cruz (R-Texas), Bill Hagerty (R-Tenn.), Kevin Cramer (R-S.D.) and Rep. Ronny Jackson...",
        "content": "President-elect Trump joined Elon Musk on Tuesday in Texas to observe the launch of a SpaceX rocket as the two leaders have spent significant time together since Election Day.    Trump was joined by some of his staff and Republican lawmakers, including Sens. Ted Cruz (R-Texas), Bill Hagerty (R-Tenn.), Kevin Cramer (R-S.D.) and Rep. Ronny Jackson (R-Texas). Trump embraced Musk, the founder of SpaceX, upon arriving at the company's Brownsville launch facility.    The president-elect earlier in the day urged Republican senators to \"Show Up and Hold the Line\" against Democratic judicial nominations.    Tuesday marked the sixth test launch of SpaceX’s Starship rocket. In its fifth test last month, SpaceX&nbsp;caught a rocket booster&nbsp;on its Texas launchpad&nbsp;as it returned to Earth. Trump regularly invoked that test launch during his campaign rallies in the closing stretch of the presidential election.    Trump and Musk have developed an increasingly close relationship in recent weeks. Musk, the CEO of Tesla and owner of social platform X, endorsed Trump after a July assassination attempt and donated millions of dollars to a pro-Trump super PAC that helped with voter turnout efforts.    Since Election Day, Musk has been a near-constant presence at Trump’s side at Mar-a-Lago in Palm Beach, Fla. He&nbsp;has joined calls&nbsp;with foreign leaders, attended meetings in Washington with the president-elect and offered input on Cabinet positions.    Musk also publicly weighed in on the ongoing fight over who Trump should pick as&nbsp;Treasury secretary&nbsp;over the weekend.    Trump has expressed fondness for Musk, who was also&nbsp;tapped to co-lead&nbsp;a new government efficiency department alongside entrepreneur and former GOP presidential candidate Vivek Ramaswamy.    But some Republicans, including those close to Trump’s transition, have suggested the honeymoon phase may not last. They have argued Trump will grow tired of Musk inserting himself into decision-making and grabbing the spotlight, just as he has in the past when officials have outshined him.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "271938ac-4935-35d9-b88a-52b0ba84a05e"
    },
    {
        "title": "Ukraine Foreign Minister: ‘The United States cannot afford to look weak’",
        "link": "https://thehill.com/policy/international/4998808-ukraine-top-diplomat-warns-us/",
        "authors": [
            "Laura Kelly"
        ],
        "date": "Tue, 19 Nov 2024 22:15:00 +0000",
        "summary": "Ukraine’s top diplomat warned that the United States cannot afford to look weak in the face of increased threats from the deepening cooperation between Russia, North Korea and Iran, addressing lawmakers on Capitol Hill on Tuesday. Ukraine’s Foreign Minister Andrii Sybiha‎ was in Washington marking 1,000 days of Ukraine’s defensive war against Russia, warning against...",
        "content": "Ukraine’s top diplomat warned that the United States cannot afford to look weak in the face of increased threats from the deepening cooperation between Russia, North Korea and Iran, addressing lawmakers on Capitol Hill on Tuesday.    Ukraine’s Foreign Minister Andrii Sybiha‎ was in Washington marking 1,000 days of Ukraine’s defensive war against Russia, warning against an “existential challenge” for Western democracies in confronting lawlessness from regimes in Moscow, Tehran and Pyongyang.&nbsp;    “Under these circumstances, the United States cannot afford to look weak. Russia, Iran, and North Korea will perceive any sign of weakness as an invitation to directly harm American interests and security,” Sybiha‎ warned during a hearing of the Helsinki Commission.    The foreign minister’s remarks served as a signal to President-elect Trump, who has pledged to pursue “peace through strength.\" But Trump’s criticism of U.S. spending on Ukraine has raised anxiety in Kyiv and among Ukraine’s supporters that his push to end the war could involve painful concessions to Russian President Vladimir Putin.     Sybiha also criticized Putin’s threats of nuclear weapons use as “blackmail,” following President Biden’s decision in recent days to green-light Ukraine using Western-provided missiles to strike targets deep inside Russia.     “Right now, we see new attempts by the Kremlin to use nuclear saber-rattling to scare the West. Their updated nuclear doctrine and public rhetoric on the use of nuclear weapons are nothing more than blackmail,” Sybiha said.    “They have used it many times before when strong decisions were made. We must remain cold-headed, clear-eyed, and not give in to empty fear.”&nbsp;    A number of Trump allies have been highly critical of Biden's decision, saying it risks escalating the war and will make a peace deal harder to achieve. However, Republican lawmakers have been largely supportive of the move.     Trump has talked about using his first days in office to end the war between Russia and Ukraine by bringing Putin and Ukrainian President Zelensky together for negotiations, but has provided little details on what a deal might look like.     Zelensky has laid out a “Victory Plan” for Ukraine, with major points including NATO offering an invitation for Ukraine to join, and building up Ukraine’s military defenses to a level to deter any future, renewed Russian aggression.    While Zelensky did not include liberating Ukrainian territory under Russian occupation as a critical part of the victory plan, Sybiha rejected ceding land to Russia in exchange for promises of peace.     “We will not accept any ‘land for peace’ deals. Such ideas will only mean leaving millions of people in the hands of the aggressor and subject to genocide, torture, and oppression,” he said.    U.S. military, economic and diplomatic support is viewed as essential in helping Ukraine defend itself against Russia’s invasion, even with robust European support.     But future U.S. support to Ukraine is in flux. While some members of Congress have said they’d like to see another aid package for Ukraine, the Biden administration has so far not sent a request to Capitol Hill.    The U.S. has provided an estimated $90 billion in aid to Ukraine since Russia launched its full-scale invasion in Feb. 2022, and has about $6 billion in funding to use up before Biden’s term ends in January.     Supplemental aid packages for Ukraine have faced increasing opposition from Republicans, with a package that passed in April delayed for months over partisan bickering, and ultimately drawing opposition from just over half of the House GOP conference.     “I don’t have much hope for the continued American support which Ukraine needs,” Rep. Steve Cohen (D-Tenn.), co-chair of the Helsinki Commission, said at the hearing on Tuesday.&nbsp;",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "1f1a8aa3-25f5-37b2-a81d-6f00f7038db8"
    },
    {
        "title": "Evening Report — Democrats kickstart search for new leaders",
        "link": "https://thehill.com/newsletters/evening-report/4998841-evening-report-dnc-democrats-leaders-2024-failures-gaetz-trump-oz/",
        "authors": [
            "Jonathan Easley"
        ],
        "date": "Tue, 19 Nov 2024 22:09:19 +0000",
        "summary": "{beacon} Evening Report ©  Greg Nash Dems look beyond 2024 failures in leader search Democrats have begun their search for new leaders as they seek to reconnect with an electorate that chose President-elect Trump and relegated Democrats to minority status in both chambers of Congress.   FIRST UP — DNC BATTLE: There are several candidates...",
        "content": "    Close                           Thank you for signing up!      Subscribe to more newsletters here                                            The latest in politics and policy. Direct to your inbox. Sign up for the Evening Report newsletter                                                                                                                                                               Subscribe                                     96&lt;!- --> {beacon}                                                                                                                                                                                                         Evening Report                                                   ©&nbsp; Greg Nash Dems look beyond 2024 failures in leader search Democrats have begun their search for new leaders as they seek to reconnect with an electorate that chose President-elect Trump and relegated Democrats to minority status in both chambers of Congress.&nbsp; FIRST UP — DNC BATTLE: There are several candidates and potential contenders to succeed Democratic National Committee (DNC) chairman Jaime Harrison.&nbsp; Former Maryland Gov. Martin O’Malley.Minnesota Democratic-Farmer-Labor Party chair Ken Martin.Rahm Emanuel, the U.S. ambassador to Japan. Ben Wikler, chair of Wisconsin Democrats.Chuck Rocha, Democratic strategist. In the House, however, Democratic members voted Tuesday to keep their current leadership in place.&nbsp; Members did not blame Rep. Hakeem Jeffries (D-N.Y.) for the party’s underwhelming performance on Election Day, as he received overwhelming support to return as House minority leader in the next Congress.&nbsp;Democrats also voted to keep Rep.&nbsp;Katherine Clark (D-Mass.) as Democratic whip, Rep. Pete Aguilar (D-Calif.) as caucus chair and Rep.&nbsp;Ted Lieu (D-Calif.) as the vice chair. &#8202;'WE LEARNED VERY LITTLE FROM 2016' The big question is where the party goes next after Trump cut deep into the Democratic coalition, winning support from working class voters and racial minorities on his way to a second term.&nbsp; Rep. Dean Phillips (D-Minn.), who is one of only a handful who tried to challenge President Biden in a 2024 primary that was effectively squashed by party leaders, said Democrats have “learned very little from 2016.”&nbsp; He said Democrats allowed themselves to be consumed by left-wing sloganeering and have become too insular, expelling anyone who doesn't pass ideological purity tests on quixotic social issues, while ignoring voter sentiments on border security for too long.&nbsp;“I believe Democrats have become, in many cases, a party centered on imposition and condemnation instead of invitation,” he told The Nation.&nbsp;And Phillips said Democrats have allowed themselves to be defined by their opposition to Trump, rather than putting out a forward-looking vision that voters find compelling.&nbsp; “Condemnation is a very poor strategy for success in politics. Casting that same shadow on all of those that support him is just an absurd and destructive approach,\"&nbsp;the Minnesota Democrat said.&nbsp; Sen.-elect Elissa Slotkin (D-Mich.) told Semafor: “I personally think that identity politics needs to go the way of the dodo.” &nbsp;Democrats, Slotkin said, need to draw their language from “the assembly line” instead of “the faculty lounge.”&nbsp; Meanwhile, a handful of House Democrats who won tough races in Trump country say the next iteration of the Democratic Party must follow their lead.&nbsp; Among them: Reps. Chris Pappas (D-N.H.), Pat Ryan (D-N.Y.) and Vicente Gonzales (D-Texas).&nbsp; The Hill’s Mike Lillis writes: “As Democratic leaders conduct an election postmortem, the front-liners are urging colleagues to take a page from their playbook, which features a heavy focus on kitchen-table economics while largely avoiding the culture-war battles that were a drag on the party on Nov. 5.” &#8202;LOOKING BACK ON 2024 Vice President Harris’s campaign finances are drawing increased scrutiny, underscored by payments to groups run by the big-name celebrities that appeared with her in the run-up to Election Day.&nbsp; The Harris campaign blew through more than $1 billion in just more than two months, only to end up about $20 million in debt.&nbsp; Via The Hill’s Caroline Vakil and Julia Manchester: “Some members of the party have questioned the campaign’s tactics, including spending money on production costs associated with celebrity-studded events with Oprah Winfrey, Beyoncé and others.” &#8202;MEANWHILE, IN THE SENATE... Sen. Bob Casey (D-Pa.) is refusing to concede to David McCormick, even after media outlets have called the race for the Republican, who traveled to Washington, D.C., for freshman orientation.&nbsp; The race is close enough to trigger an automatic recount, if Casey refuses to concede.&nbsp; The Pennsylvania Supreme Court late Monday rebuked the Democratic officials in the state who said they’d defy the court and count undated and misdated mail ballots. McCormick would still have a significant lead even if those illegal ballots are counted.&nbsp; Pennsylvania Gov. Josh Shapiro (D) said the Democratic election officials must “adhere to this ruling and all the applicable laws governing our elections.”&nbsp;“Any insinuation that our laws can be ignored or do not matter is irresponsible and does damage to faith in our electoral process,\" Shapiro said.&#8202; 💡Perspectives: • The Hill: What the exit polls say about the 2024 election. • Vox: Dems got wiped out in 2004. This is what they did next.• Los Angeles Times: Ousted L.A. county prosecutor was his own worst enemy.• Intelligencer: What happened to the minor party candidates?• The Liberal Patriot: What next for independents?&#8202;Read more:&nbsp; •&nbsp;Hispanic, Asian counties shifted by double-digits to the right. • Indie Senate candidate from Nebraska launches working class group. • Manchin: \"There is a need for a third party.\" • Voters split over whether campaign media coverage was fair. Welcome to Evening Report! I'm Jonathan Easley, catching you up from the afternoon and what's coming tomorrow. Not on the list? Subscribe here.&#8202;CATCH UP QUICK&#8202;  Trump has nominated TV personality&nbsp;and former Pennsylvania GOP Senate candidate Mehmet Oz to&nbsp;lead the Centers for Medicare and Medicaid Services.&nbsp; Manhattan prosecutors said they oppose President-elect Trump’s demand to dismiss his New York criminal conviction, and are instead trying to freeze the case until Trump leaves office. California health officials are investigating a bird flu infection in a child. The Department of Justice will push Google to sell Chrome to break its search monopoly.&nbsp; The U.S. dollar faces headwinds after a post-election rally.&nbsp;  NEWS THIS AFTERNOON ©&nbsp; Greg NashGaetz drama consumes Capitol Hill The battle over former Rep. Matt Gaetz’s (R-Fla.) nomination to lead the Justice Department is getting uglier by the day.&nbsp;The latest: An attorney representing several women who testified to the House Ethics Committee is making the media rounds, telling ABC News the former congressman paid for sex, inquired about purchasing drugs and had sex with a 17-year-old girl. Gaetz denies the allegations. A hacker gained access to witness testimony about Gaetz, including sealed files from the Justice Department and House Ethics Committee.The ethics panel will meet Wednesday as it faces pressure to release a report detailing its investigation into Gaetz ahead of his confirmation hearing. Vice President-elect JD Vance will shepherd Gaetz and Pete Hegseth, Trump's pick to lead the Department of Defense, across Capitol Hill later this week as the nominees meet with senators.&nbsp; Those developments overshadowed Trump’s latest Cabinet selections. Trump is expected to tap Cantor Fitzgerald CEO Howard Lutnick&nbsp;to lead the Commerce Department. Trump picked former Rep. Sean Duffy (R-Wis.) to be Transportation Secretary. Here are five things to know about Duffy. Trump’s initial favorability rating as president-elect is at 54 percent.&#8202; ELSEWHERE... The American Civil Liberties Union is suing Immigration and Customs Enforcement for records ahead of Trump’s planned mass deportations. &nbsp;Trump this week said he’d use the military to assist in carrying out his deportation plans.&nbsp; Arizona Gov.&nbsp;Katie Hobbs (D)&nbsp;said she will work with Trump “to continue efforts on border security” when he takes office in January, but she won’t ”tolerate terrorizing communities.” &#8202;💡Perspectives: • The Hill: A progressive’s plea: Confirm Matt Gaetz.&nbsp; &#8202;Read more: • Matt Gaetz could launch Big Tech crackdown at DOJ.  • GOP senators deride idea of replacing FBI background checks for Trump nominees.  • Gaetz and Hegseth controversies could trickle down to Trump &#8202;CONGRESS FEMA director testifies about avoiding Trump homes&nbsp;&nbsp; Federal Emergency Management Agency (FEMA) Director Deanne Criswell answered tough questions from House Republicans on Tuesday about an employee who said the agency advised workers to skip homes with Trump signs as they administered relief following Hurricanes Milton and Helene.&nbsp; Criswell told Rep. Scott Perry (Pa.), a key Republican on the House Transportation and Infrastructure Committee, that the allegations from FEMA official Marn'i Washington did not reflect orders handed down by agency leadership.&nbsp; “We’ve questioned other personnel in the chain-of-command, and we find no information at this point that there was anything beyond her direction to her employees to skip and bypass a home,” Criswell said.&nbsp;She said Washington is at the “lowest level of supervision” within the agency, and that while the investigation is ongoing, they’ve so far found “no evidence that there is anything beyond this one employee’s specific direction.”&nbsp;Criswell said she’d request an independent investigation by the Inspector General.&#8202; ELSEWHERE... Rep. Nancy Mace (R-S.C.) introduced a bill to bar transgender women from facilities on Capitol Hill that match their gender identity.&nbsp;The resolution comes a week after Rep.-elect Sarah McBride (D-Del.) made history&nbsp;as the first transgender person elected to Congress.&nbsp; The bill provoked an uproar among Democrats, who called it “bullying.”&nbsp; Speaker Mike Johnson (R-La.) sidestepped specifics about how he’d handle the resolution, but said:&nbsp;“We treat all persons with dignity and respect.”&#8202; Read more: •&nbsp;Johnson becomes ‘MAGA’ Mike, cementing place in Trump’s circle.•&nbsp;House passes major veterans care act. •&nbsp;Democrats look at late-night, weekend votes to confirm last Biden judicial nominees. &#8202;ON TAP President Biden leaves the G20 summit in Brazil and travels back to Washington.&nbsp; Vice President Harris travels to Hawaii.&nbsp;President-elect Trump will be in Brownsville, Texas, this evening to visit a SpaceX factory and watch a Starship launch.&nbsp;28 days until electors vote in their states.31 days&nbsp;until the government funding deadline. 45 days&nbsp;until the new Congress begins and the House leadership elections.48 days&nbsp;until Congress counts the electoral votes.62 days&nbsp;until Inauguration Day.&#8202;  IN OTHER NEWS © &nbsp;Drew Angerer/Getty ImagesPutin responds to Biden authorizing Ukraine’s use of American long-range missiles Russian President Vladimir Putin lowered his country’s threshold to use nuclear weapons in response to President Biden authorizing Ukraine’s use of American-made long-range missiles.&nbsp; Via The Hill’s Brad Dress: “Putin updated his nuclear doctrine, “Basic Principles of State Policy of the Russian Federation on Nuclear Deterrence,” to say that any aggression from a nonnuclear state with the support of a nuclear state will be treated as a joint attack on Russia.” &nbsp; Ukraine on Monday carried out its first strike with American-made long-range missiles in the Russian province of Kursk.&#8202; 💡Perspectives: • The Hill: It’s time to change course on Ukraine.&#8202; Read more: •&nbsp;1,000 days of war in Ukraine. •&nbsp;Half of Ukrainians want talks to end war with Russia: Gallup. •&nbsp;Russia starts making nuclear-resistant mobile bomb shelters. &#8202; Stay Engaged&#8202; Follow TheHill.com for the latest and recommend us to others: TheHill.com/Evening. See you next time.  ",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "134a2334-5683-3794-ad77-a7eb2b7286c5"
    },
    {
        "title": "Oversight panel presses FEMA administrator on hurricane relief discrimination allegations",
        "link": "https://thehill.com/policy/energy-environment/4998801-fema-administrator-grilled-hurricane-milton-trump-campaign-signs/",
        "authors": [
            "Zack Budryk"
        ],
        "date": "Tue, 19 Nov 2024 21:56:19 +0000",
        "summary": "The House Oversight and Accountability Committee grilled Federal Emergency Management Agency (FEMA) Administrator Deanne Criswell on Tuesday over a since-fired FEMA employee's directive that staff avoid houses with Trump campaign signage in the wake of Hurricane Milton and the employees' allegations that she was \"simply following orders.\" The fired FEMA employee, Marn’i Washington, has alleged she was...",
        "content": "The House Oversight and Accountability Committee grilled Federal Emergency Management Agency (FEMA) Administrator Deanne Criswell on Tuesday over a since-fired FEMA employee's directive that staff avoid houses with Trump campaign signage in the wake of Hurricane Milton and the employees' allegations that she was \"simply following orders.\"    The fired FEMA employee, Marn’i Washington, has alleged she was scapegoated, saying in a Monday interview that she doesn't&nbsp;\"create policy” and denying that she violated the Hatch Act, which restricts political activity by government employees.    \"So firstly, I’m being framed. There’s no violation of the Hatch Act. I was simply following orders,” Washington said in an interview on NewsNation’s “Dan Abrams Live.”    “I execute orders. I don’t create policy. I do not reinvent the wheel. My record shows that,” she said later in the interview.    Rep. Jim Jordan (R-Ohio) asked Criswell during the hearing whether Washington was “lying” about the practice being common and whether the FEMA administrator had directly spoken to the 13 other people&nbsp;to&nbsp;whom the orders were texted.    Criswell said she had not directly spoken to them&nbsp;but suggested they would be interviewed as part of an investigation into the incident.    She also reiterated in response to questioning from ranking member Jamie Raskin (D-Md.) that she had requested an Office of Inspector General investigation into the orders, echoing her response to Rep. Scott Perry (R-Pa.) in a separate hearing before the House Transportation Committee’s Subcommittee on Economic Development, Public Buildings and Emergency Management on Tuesday morning.    The Oversight&nbsp;committee was frequently split along party lines in their lines of questioning for Criswell&nbsp;and the broader themes they tackled&nbsp;within the hearing. Committee Chair James Comer (R-Ky.) and Jordan attempted to cast the directive as part of broader disdain for supporters of President-elect Trump, while House Democrats frequently brought up the spread of misinformation surrounding FEMA’s presence and the threat of climate change.&nbsp;    False claims about government funding began circulating online shortly after Hurricane Helene struck Florida, Georgia and North Carolina in September. Then-candidate Trump was among those who shared such claims on social media, including that the government was&nbsp;purposely withholding aid&nbsp;from Republican hurricane victims while FEMA redirected disaster relief funds to migrants. FEMA refuted both claims, as well as other inaccurate information surrounding the agency's storm response.    Government officials, meanwhile, warned that the spread of inaccurate information was complicating relief efforts.    Rep. Maxwell Frost (D-Fla.) questioned Criswell on Tuesday on the effects of such misinformation, to which the FEMA administrator responded that it “makes individuals who have perhaps lost everything concerned about whether they should come to us for assistance.”    The panel’s Republicans, meanwhile, pressed Criswell on whether Washington's orders were reflective of any broader official or unofficial agency policy.&nbsp;    Questioned by Rep. Byron Donalds (R-Fla.) about whether FEMA would be willing to provide all internal communications involving the fired employee and her former supervisors, Criswell suggested the agency would, saying it “always cooperates” with such requests for information.    On the other side of the aisle, Rep. Jared Moskowitz (D-Fla.) said FEMA “did the right thing” by firing Washington and calling for an investigation, and faulted Washington for saying she was motivated by discomfort in certain areas of the state, saying she should instead have gone through proper channels to address them.    However, Moskowitz blamed deeper issues within FEMA on the size of the bureaucracy within its parent department, the Department of Homeland Security, saying that “this is not new, this has been going on for a while, it happened during the Trump administration.”    “FEMA can’t make the changes you want them to make, Homeland won’t let them because there’s 30 people around a table,” he added.    Committee members were also split in their assessment of FEMA’s responses to the recent hurricanes.&nbsp;    Raskin singled out the agency as a commendable&nbsp;institution in his opening remarks, pointing to praise from Republican Govs. Glenn Youngkin of Virginia and Ron DeSantis of Florida for the agency's response to recent storms.    Rep. Virginia Foxx (R-N.C.), meanwhile,&nbsp;whose district was affected by Hurricane Helene, suggested in her questioning of Criswell that FEMA had not been forthcoming in providing reliable information to affected citizens.    But Frost, whose district was also impacted, said his constituents had had “nothing but praise” for the FEMA response, and pointed to recent reports that Trump himself withheld disaster aid for political purposes.     Separate Politico reports from earlier this year alleged Trump ignored a request for aid from Washington Gov. Jay Inslee (D) and had been preparing to withhold aid from Orange County, Calif., before he was told he had more voters in the county than the state of Iowa.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "7e760dcc-0d89-3966-b6ce-5b525b0c85f1"
    },
    {
        "title": "Tuberville says Gaetz vote depends on if ‘they can prove’ allegations",
        "link": "https://thehill.com/homenews/campaign/4998700-tuberville-gaetz-vote-depends-on-if-they-can-prove-allegations/",
        "authors": [
            "Ashleigh Fields"
        ],
        "date": "Tue, 19 Nov 2024 21:48:46 +0000",
        "summary": "Sen. Tommy Tuberville (R-Ala.) said he would not support former House Republican Matt Gaetz for attorney general if the sexual assault allegations against him are proven true. Gaetz was accused of having relations with a 17-year-old minor at a party in 2017.  Tuberville said Gaetz denied any wrongdoing in a conversation last week, as reported...",
        "content": "Sen. Tommy Tuberville (R-Ala.) said he would not support former House Republican Matt Gaetz for attorney general if the sexual assault allegations against him are proven true.     Gaetz was accused of having relations with a 17-year-old minor at a party in 2017.     Tuberville said Gaetz denied any wrongdoing in a conversation last week, as reported by CBS 42 Tuesday.    “Good because if it comes out they can prove something, I’m not going to vote for you,” Tuberville responded.&nbsp;    He added that Gaetz would face complications being confirmed if there’s “anything following him.”    Some Republicans have called on the House Ethics Committee to release their findings publicly while Sen. Dick Durbin (D-Ill.), chair of the Senate Judiciary Committee, said the report should be shared with his committee.     However, Sens. Susan Collins (R-Maine) and Lisa Murkowski (R-Alaska) have publicly expressed disdain with President-elect Trump’s pick for the position.    “I don’t think it’s a serious nomination for attorney general. We need to have a serious attorney general,” Murkowski said once the news broke.&nbsp;    “I’m looking forward to the opportunity to consider somebody that is serious.”    Former Speaker Kevin McCarthy (R-Calif.) said Gaetz would not gain the votes needed to be confirmed.&nbsp;    “Look, Gaetz won’t get confirmed,” McCarthy told reporters. “Everybody knows that.”Members of the House Ethics Committee are slated to meet on Wednesday to determine if they will release the report.    The Hill has reached out to Gaetz for comment.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "a3b68161-e611-3048-ba1e-3c32960bde4f"
    },
    {
        "title": "Trump to nominate Mehmet Oz for CMS administrator",
        "link": "https://thehill.com/policy/healthcare/4998738-trump-oz-cms-nomination/",
        "authors": [
            "Nathaniel Weixel"
        ],
        "date": "Tue, 19 Nov 2024 21:32:31 +0000",
        "summary": "President-elect Trump said Tuesday he is nominating television personality and Dr. Mehmet Oz to serve as the Centers for Medicare and Medicaid Services (CMS) administrator.  Oz unsuccessfully ran for Senate in Pennsylvania in 2022 with Trump's endorsement and has been a Trump ally ever since. The CMS administrator is a Senate-confirmed position.   “There may...",
        "content": "President-elect Trump said Tuesday he is nominating television personality and Dr. Mehmet Oz to serve as the Centers for Medicare and Medicaid Services (CMS) administrator.     Oz unsuccessfully ran for Senate in Pennsylvania in 2022 with Trump's endorsement and has been a Trump ally ever since.     The CMS administrator is a Senate-confirmed position. &nbsp;    “There may be no Physician more qualified and capable than Dr. Oz to Make America Healthy Again,” Trump said in a statement, referring to the slogan pioneered by Robert F. Kennedy Jr., the famous antivaccine activist he tapped to lead the Department of Health and Human Services.     \"Dr. Oz will be a leader in incentivizing Disease Prevention, so we get the best results in the World for every dollar we spend on Healthcare in our Great Country,” Trump said. “He will also cut waste and fraud within our Country’s most expensive Government Agency, which is a third of our Nation’s Healthcare spend, and a quarter of our entire National Budget.”&nbsp;    Like Kennedy, Oz has no experience running a massive bureaucracy. CMS operates Medicare, Medicaid, the Children’s Health Insurance Program and the federal Healthcare.gov&nbsp;ObamaCare exchange.&nbsp;    Between all four programs, CMS oversees health coverage for more than 150 million people.     Oz rose to prominence as a guest on Oprah Winfrey's talk show, before launching his own program in 2009. Trump appeared on the show during his 2016 campaign to reveal the results of his physical exam.    Oz has come under fire from other medical professionals for pushing unproven medical treatments and diets. Notably, he faced criticism in 2020 for promoting the anti-malaria drug hydroxychloroquine to treat COVID-19.    Updated at 5:09 p.m.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "c3daee19-44f8-31c2-9588-4c9255a9a3bd"
    },
    {
        "title": "Walmart CFO says some prices might rise if Trump's tariffs take effect",
        "link": "https://thehill.com/business/4998684-walmart-trump-tariffs-prices/",
        "authors": [
            "Ashleigh Fields"
        ],
        "date": "Tue, 19 Nov 2024 21:31:42 +0000",
        "summary": "A Walmart executive warned that President-elect Trump’s plans to raise tariffs on imports could drive the retail giant to increase the price of store items. “We never want to raise prices,” John David Rainey, the company’s CFO said in an interview with CNBC on Tuesday. “Our model is everyday low prices. But there probably will be cases where prices will go up for consumers.”...",
        "content": "A Walmart executive warned that President-elect Trump’s plans to raise tariffs on imports could drive the retail giant to increase the price of store items.    “We never want to raise prices,” John David Rainey, the company’s CFO said in an interview with CNBC on Tuesday. “Our model is everyday low prices. But there probably will be cases where prices will go up for consumers.”    Trump has proposed a 10 percent to 20 percent tariff on all imported goods, and a tariff of at least 60 percent on Chinese imports. Republicans generally have backed him on the economic front, agreeing that the U.S. should “reset its economic relationship with China.”    The company has reported that two-thirds of merchandise sold in Walmart U.S. and 93 percent of merchandise sold in Walmart Mexico is \"made, grown or assembled domestically.\" This stemmed from a 2021 commitment to $350 billion effort to invest in home-grown products.     Rainey said he thinks Walmart will work to avoid taking a hit from Trump’s proposed policies.    “We’ve been living under a tariff environment for seven years, so we’re pretty familiar with that,” he told CNBC. “Tariffs, though, are inflationary for customers, so we want to work with suppliers and with our own private brand assortment to try to bring down prices.”",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "167097cb-ec22-3c43-b7d8-dd40e120d815"
    },
    {
        "title": "Jeffries: Republicans don't have a mandate",
        "link": "https://thehill.com/homenews/house/4998716-hakeem-jeffries-republican-mandate/",
        "authors": [
            "Mike Lillis"
        ],
        "date": "Tue, 19 Nov 2024 21:30:35 +0000",
        "summary": "House Minority Leader Hakeem Jeffries (D-N.Y.) on Tuesday rejected the idea that voters delivered an Election Day mandate to Donald Trump and the Republicans, arguing that the GOP’s razor-thin majority in the House means that nothing will get done in Washington without Democratic support. “Despite the claims of some of my Republican colleagues, who have...",
        "content": "House Minority Leader Hakeem Jeffries (D-N.Y.) on Tuesday rejected the idea that voters delivered an Election Day mandate to Donald Trump and the Republicans, arguing that the GOP’s razor-thin majority in the House means that nothing will get done in Washington without Democratic support.    “Despite the claims of some of my Republican colleagues, who have spent a lot of time over the last two weeks talking about some big, massive mandate — I’m looking for it,” Jeffries said during a press briefing in the Capitol.    The comments were a shot at the Republicans who, after winning control of the House, Senate and White House in the next Congress, have asserted broad powers to pursue a starkly conservative policy agenda.     That includes Trump, who used his victory speech on election night to claim “an unprecedented and powerful mandate,” and Speaker Mike Johnson (R-La.), who argued Tuesday that voters gave Trump the authority to seat his preferred Cabinet picks — regardless of any controversy swirling around them.&nbsp;    “President Trump is looking for persons who will shake up the status quo, and we got a mandate in this election cycle to do that,” Johnson told reporters in the Capitol. “The status quo is not working for the American people. And so these are persons who will go in and bring real reform — significant reform — to the agencies that they lead.”&nbsp;    Jeffries, who was elected on Tuesday to lead House Democrats again in the next Congress, is vowing to work with the incoming administration on areas of shared interest, while also promising a fight if Republicans seek to slash the Democrats’ sacred cows, including abortion rights and benefits under Social Security, Medicare, Medicaid and ObamaCare.    “We will push back against far-right extremism whenever necessary,” Jeffries said.    House Democrats will likely have some leverage in those coming policy fights. While Republicans will control all levers of power in Washington next year, GOP leaders have struggled repeatedly to unite their feuding troops to pass even the most fundamental bills, like funding the federal government.&nbsp;    Those difficulties are expected to continue in the next Congress, even with an ally in the White House, as GOP leaders seek to move Trump’s ambitious — and costly — legislative agenda in the face of expected resistance from conservative deficit hawks. While Republicans kept House control in this month’s elections, their majority will be razor thin, just as it was throughout the current Congress. And the Senate filibuster ensures that Democrats, while relegated to the minority in the next Congress, will also maintain significant influence over most bills that move through the upper chamber.&nbsp;    That combination, Jeffries said Tuesday, means Democrats will have plenty of legislative sway in the next Congress — and belies the GOP’s claims to a mandate.&nbsp;    “The question about this notion of some mandate to make massive far-right extreme policy changes — it doesn’t exist. It doesn’t exist,” Jeffries said.&nbsp;    “And so in the new Congress, for anything to happen — particularly as it relates to an enlightened spending agreement, or ensuring that America does not default on our debt and crash the economy and hurt everyday Americans for the first time in our nation’s history — it’s clear House Republicans cannot do it on their own.”",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "d89f3256-d0cc-3e42-98c7-979bf86f320e"
    },
    {
        "title": "Mace eyes legislation banning trans women from restrooms in federal buildings",
        "link": "https://thehill.com/homenews/house/4998702-nancy-mace-trans-women-bathrooms/",
        "authors": [
            "Brooke Migdon"
        ],
        "date": "Tue, 19 Nov 2024 21:21:10 +0000",
        "summary": "Rep. Nancy Mace (R-S.C.) plans to file legislation that would prohibit trans women from using women’s restrooms and changing rooms in all federal buildings, going further than a resolution Monday to bar transgender women from Capitol facilities. “I’m working on legislation that would ban it on federal property,” Mace told reporters Tuesday morning. The bill would...",
        "content": "Rep. Nancy Mace (R-S.C.) plans to file legislation that would prohibit trans women from using women’s restrooms and changing rooms in all federal buildings, going further than a resolution Monday to bar transgender&nbsp;women from Capitol facilities.    “I’m working on legislation that would ban it on federal property,” Mace told reporters Tuesday morning. The bill would also apply to schools, she said.    “If you are a school that is funded by the federal government, this shouldn’t go on,” Mace told reporters.    Asked about the details of her proposal, Mace said she is “absolutely”&nbsp;going to expand her initial resolution, which aims to prohibit members, officers and employees of the House from using single-sex facilities that correspond to their gender identity. “Wait till you see what I file next,” she said.    Mace’s new bill could run afoul of the Biden administration’s latest changes to Title IX, the federal civil rights law preventing sex discrimination in schools and education programs that receive government funding. The administration’s new rule, which the Education Department finalized in April,&nbsp;forbids policies that categorically ban transgender students from school bathrooms that align with their gender identity.    Federal judges have blocked the changes, which do not apply to athletics, in at least 26 states, and the Supreme Court in August denied the Biden administration’s request to partially reinstate the new rule.    President-elect Trump has promised to roll back the&nbsp;latest interpretation of Title IX “on day one” of his presidency, though fully reversing and replacing the Biden administration’s changes could take several years.    “The only thing that violates Title IX are men being in women’s spaces,” Mace said Tuesday, “and I’m going to put a f---ing stop to this bull---- and this insanity.”    Mace’s original resolution, which she filed late Monday, comes just a week after Rep.-elect Sarah McBride (D-Del.) made history as the first openly transgender person elected to Congress.    The measure charges the House sergeant-at-arms, William McFarland, with enforcing the ban, but it is unclear how the House’s chief law enforcement officer will determine who can and cannot use the Capitol’s facilities.&nbsp;    State laws that bar trans people from using public restrooms that match their gender identity often rely on anonymous complaints, a notoriously unreliable enforcement mechanism. LGBTQ rights activists in May&nbsp;flooded a tip line&nbsp;designed to alert officials in Utah to possible violations of the state’s bathroom ban with thousands of false complaints.    In a statement, McBride brushed off Mace’s resolution as a distraction and accused&nbsp;far-right Republicans of “manufacturing culture wars.”    “Delawareans sent me here to make the American dream more affordable and accessible and that’s what I’m focused on,” she said.    “It’s been a while since Nancy Mace had her 15 minutes of fame,” said Rep. Mark Pocan (D-Wis.), chair of the Congressional Equality Caucus, which&nbsp;promotes LGBTQ equality in the House. The resolution, he said, “is a pathetic, attention-seeking attempt to grab Trump’s eye and the media spotlight — and trans people, including trans employees, are paying the price.”    House Speaker Mike Johnson (R-La.), who has sought to ban gender-affirming care for minors and prohibit transgender student-athletes from competing on sports teams that match their gender identity, on Tuesday declined to weigh in on Mace’s resolution.    “We’ll provide appropriate accommodation for every member of Congress,” he said.    Later on Tuesday, Johnson said he believes “a man is a man, and a woman is a woman.”    “But I also believe we treat everybody with dignity,” he said. “We can do and believe all those things at the same time.”    Mace has rejected assertions from some Democrats and LGBTQ rights groups that her resolution discriminates against LGBTQ people. She told reporters that she broadly supports the community, twice voting to codify same-sex marriage protections.    “But I have a big fat red line when it comes to men and women’s private spaces,” she told the Washington Post on Tuesday.    Mace’s resolution and forthcoming proposal come amid Democratic infighting over the role the party’s broad support for transgender rights played in its failure to capture the presidency and either chamber of Congress.    Trump and Republicans bet big on anti-transgender messaging in the final stretch of the election, pouring millions into ads that painted their Democratic opponents as extreme and out of touch with most Americans for supporting trans-inclusive policies.    Just 4 percent of voters said opposition to transgender athletes and surgeries drove their vote in this year’s election, according to exit polling&nbsp;released by the Human Rights Campaign, the nation’s largest LGBTQ advocacy group.    Mychael Schnell contributed.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "2698d521-9ce5-3ac9-ab27-582c0e184d11"
    },
    {
        "title": "Almost 100 House Democrats push for release of Gaetz Ethics report",
        "link": "https://thehill.com/homenews/house/4998613-almost-100-house-democrats-push-for-gaetz-report-release/",
        "authors": [
            "Lauren Irwin"
        ],
        "date": "Tue, 19 Nov 2024 20:59:25 +0000",
        "summary": "Nearly 100 House Democrats wrote to the House Ethics Committee urging them to publish its report on former Rep. Matt Gaetz (R-Fla.) and their investigation into his alleged misconduct after President-elect Trump nominated him to serve as attorney general. “We are writing today to request that you immediately release the Ethics Committee’s report into allegations...",
        "content": "Nearly 100 House Democrats wrote to the House Ethics Committee urging them to publish its report on former Rep. Matt Gaetz (R-Fla.) and their investigation into his alleged misconduct after President-elect Trump nominated him to serve as attorney general.    “We are writing today to request that you immediately release the Ethics Committee’s report into allegations of serious misconduct by former Congressman Matt Gaetz,” the Democratic lawmakers wrote Tuesday in a letter led by Rep. Sean Casten (Ill.).    The lawmakers argue it’s “critical” the Senate has all the information necessary as they consider Gaetz’s nomination.    Gaetz resigned from the House last week, just hours after Trump tapped him to be the next attorney general.    The former Florida congressman has denied wrongdoing in the years-long investigation into the allegations that he had a sexual relationship with a minor. The Department of Justice closed its investigation last year and did not press any charges.    Pressure is mounting on the committee, with lawmakers asking for more information to be made public before they vote on his nomination.    Members of the committee will meet Wednesday as they weigh whether it will release its report about Gaetz, since they typically don’t make findings public for a former lawmaker.    The Democrats noted in the past, the committee has released its findings in certain situations even after a member has resigned.    “We strongly believe that this situation meets or exceeds those standards,” they wrote in the letter. “This is not a partisan issue.”    “Given the seriousness of the charges against Representative Gaetz, withholding the findings of your investigation may jeopardize the Senate’s ability to provide fully informed, constitutionally required advice and consent regarding this nomination,” the Democrats wrote.    Some Republican lawmakers, including Speaker Mike Johnson (R-La.), are opposed to the information becoming public.    Earlier Tuesday, a hacker gained access to witness testimony related to investigations into Gaetz. An unidentified person downloaded information on Monday afternoon, and the file included 24 exhibits and is reported to include testimony from a woman who said she had sex with Gaetz when she was 17 years old.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "4f57cc1a-88e3-312a-977b-1149c3a97d1e"
    },
    {
        "title": "Lawmaker offers tips on perks for incoming members of Congress",
        "link": "https://thehill.com/blogs/in-the-know/4998566-susie-lee-congress-freshman-guide/",
        "authors": [
            "Tara Suter"
        ],
        "date": "Tue, 19 Nov 2024 20:53:23 +0000",
        "summary": "Rep. Susie Lee (D-Nev.) offered to incoming members of Congress a one-sheet of tips and perks as they prepare to join the legislative branch. “Congratulations!” Lee wrote in the guide to freshmen. “You made it! You are here! Serving in Congress has truly been the honor of my lifetime, and I am sure it will be for you as well. You will...",
        "content": "Rep. Susie Lee (D-Nev.) offered to incoming members of Congress a one-sheet of tips and perks as they prepare to join the legislative branch.    “Congratulations!” Lee wrote in the guide to freshmen. “You made it! You are here! Serving in Congress has truly been the honor of my lifetime, and I am sure it will be for you as well. You will never cease to be humbled by the sight of the Capitol Dome.”    “Between finding an apartment, setting up an office, orientation, getting to know people, elections, and hiring a staff, these first few weeks can be incredibly overwhelming,” she added. “In the 6 years that I have had the honor to serve, I have found a few things that provide some relief in an incredibly demanding job.”    Lee then listed perks and helpful hints, including the ability for lawmakers to “schedule trips to the National Archives ‘treasure vault’ of historic records dating back to 1789,” advising them on timing on food delivery on Capitol Hill and telling them to go “on a walk every now and then.”    “Take time to appreciate the history of these hallowed grounds and the significance of the work we are called upon to do,” Lee said in a final point.    Lee was reelected to her fourth term this month.    The new Congress is will convene Jan. 3, and lawmakers will be sworn into the 119th Congress. ",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "85a2c5ad-5e3a-37c8-b9d4-8049727a44aa"
    },
    {
        "title": "Grassley: Gaetz Ethics report's release would result in 'faster consideration' of nomination",
        "link": "https://thehill.com/homenews/4998609-grassley-gaetz-ethics-report/",
        "authors": [
            "Alexander Bolton"
        ],
        "date": "Tue, 19 Nov 2024 20:51:02 +0000",
        "summary": "Sen. Chuck Grassley (Iowa), the incoming Republican chair of the Senate Judiciary Committee, said Tuesday that the House Ethics Committee would help speed up the Senate’s consideration of former Rep. Matt Gaetz (R-Fla.) to lead the Justice Department if it releases its report on Gaetz. “I would suggest if they want a speedy consideration of...",
        "content": "Sen. Chuck Grassley (Iowa), the incoming Republican chair of the Senate Judiciary Committee, said Tuesday that the House Ethics Committee would help speed up the Senate’s consideration of former Rep. Matt Gaetz (R-Fla.) to lead the Justice Department if it releases its report on Gaetz.    “I would suggest if they want a speedy consideration of this … it would help faster consideration, the extent to which they would make as much available as they can,” Grassley told a CNN camera crew on Capitol Hill.    Grassley said some of his GOP colleagues “have some questions” about Gaetz’s fitness to serve as the nation’s next attorney general. &nbsp;    He is the latest Republican senator to urge the House Ethics Committee to release its findings on Gaetz, who is accused of sexual misconduct and illicit drug use.    Sen. John Cornyn (R-Texas), another member of the Senate Judiciary Committee, told reporters last week that the Senate should have access to the House Ethics Committee’s report.    “I don’t believe there should be any restriction, including on that,” he said, arguing senators voting on Gaetz’s nomination should have access to all relevant materials.    Sen. Markwayne Mullin (R-Okla.) has also called for the report to be released.    \"That should be definitely part of our decisionmaking,\" he said on NBC’s “Meet the Press.”    “The background of Matt Gaetz does matter,” he argued.    Senate Judiciary Committee Chair Dick Durbin (D-Ill.) said Gaetz’s sudden resignation from the House raises “serious questions,” because the House Ethics panel typically does not release reports on former lawmakers.    The Florida Republican resigned from Congress as the release of the Ethics Committee’s report was imminent, a source familiar with the matter told The Hill last week.    “We cannot allow this valuable information from a bipartisan investigation to be hidden from the American people. Make no mistake: this information could be relevant to the question of Mr.&nbsp;Gaetz’s confirmation as the next Attorney General of the United States&nbsp;and&nbsp;our constitutional responsibility of advice&nbsp;and&nbsp;consent,”&nbsp;Durbin said in a statement.    Speaker Mike Johnson (R-La.) and other House Republicans have called on the Ethics panel to keep its report secret, warning it would set a bad precedent to issue reports on individuals who have already left Congress.    “It should not come out,” Johnson told CNN’s “State of the Union.”",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "64517a6d-ed47-3f85-acc2-9b48828de659"
    },
    {
        "title": "Texas education officials vote to back optional Bible lessons for K-5 classes: Reports",
        "link": "https://thehill.com/homenews/education/4998583-texas-bible-lessons-public-schools/",
        "authors": [
            "Lexi Lonas Cochran"
        ],
        "date": "Tue, 19 Nov 2024 20:43:06 +0000",
        "summary": "In a preliminary vote on Tuesday, Texas education officials approved a proposal to allow lessons about the Bible into public school classrooms, according to multiple news reports.   The state Board of Education voted 8-7 to adopt standards that would teach biblical lessons to students kindergarten through fifth grade, The New York Times reported.   Critics...",
        "content": "In a preliminary vote on Tuesday, Texas education officials approved a proposal to allow lessons about the Bible into public school classrooms, according to multiple news reports.      The state Board of Education voted 8-7 to adopt standards that would teach biblical lessons to students kindergarten through fifth grade, The New York Times reported.      Critics have said the material disproportionately focuses on Christianity, only briefly mentioning other religions such as Judaism or Islam. &nbsp;    While schools will not be required to take on the curriculum, they will get an extra $60 per student in funding if they do so. &nbsp;    The final board vote to officially implement the new curriculum will take place on Friday, according to The Texas Tribune.      “Texas AFT [American Federation of Teachers] believes that not only do these materials violate the separation of church and state and the academic freedom of our classroom, but also the sanctity of the teaching profession. These prescriptive materials cannot meet all learners in all contexts, and teachers must be empowered to adapt to the needs of their students,” the group said in a statement.      The state Board of Education heard testimony from 150 people on Monday for eight hours, both in support and against the new curriculum.     “Just reading some of the passages from the Bible will not cause someone to convert, as many Biblical scholars are not themselves Christian,” supporter Glenn Melvin said during the testimony, local outlet WPSD reported.&nbsp;    The new revisions focus on K through 5 reading and English classes and were structured around the state-level Bluebonnet Learning.     The Texas Freedom Network, which focuses on religious freedom, released a report saying they do not support the standards.&nbsp;    The group said the problems with the material are “systemic—especially the curriculum’s ‘Bible-infused’ character and resulting religious imbalance—and require a thorough overhaul rather than piecemeal revision.\"     “The BB version still verges on Christian proselytism insofar as its extensive, lopsided coverage of Christianity and the Bible suggests that this is the only religious tradition of any importance. That is not a message that Texas public schools, which are called to serve a religiously diverse population, have any business conveying,” the report added. &nbsp;    The move has been in development for months and comes after Texas became the first state to allow religious chaplains in schools.      Earlier this year, neighboring Oklahoma issued an education mandate ordering that biblical lessons be incorporated into public school curricula. That measure has been challenged in court.",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "39476ce9-6cac-3a25-93df-fcf5f02a31e1"
    },
    {
        "title": "Lee to lead Senate Energy committee next year",
        "link": "https://thehill.com/policy/energy-environment/4998536-mike-lee-senate-energy-natural-resources-committee/",
        "authors": [
            "Rachel Frazin"
        ],
        "date": "Tue, 19 Nov 2024 20:18:18 +0000",
        "summary": "Sen. Mike Lee (R-Utah) will lead the Senate Energy and Natural Resources Committee next year. He’ll take over for the panel’s current top Republican, Sen. John Barrasso (R-Wyo.), who will become the upper chamber's No. 2 Republican next year.  Current Chairman Joe Manchin (I-W.Va.) is retiring. Sen. Martin Heinrich (D-N.M.) will take over as ranking...",
        "content": "Sen. Mike Lee (R-Utah) will lead the Senate Energy and Natural Resources Committee next year.    He’ll take over for the panel’s current top Republican, Sen. John Barrasso (R-Wyo.), who will become the upper chamber's No. 2 Republican next year.&nbsp;    Current Chairman Joe Manchin (I-W.Va.) is retiring. Sen. Martin Heinrich (D-N.M.) will take over as ranking member.&nbsp;    Neither Heinrich's nor Lee's appointment is a surprise.&nbsp;    But Barrasso and Manchin announced Tuesday following a committee meeting that both lawmakers would take the panel’s top spots, and Manchin literally passed his gavel to Lee.    In a post on the social media website X, Lee also announced that he would helm the committee.    “Humbled and honored to take the gavel as the next Chairman of the Senate Energy and Natural Resources Committee,” he wrote. “Time to get to work and unleash American energy.”    The Energy and Natural Resources Committee has jurisdiction over the Energy and Interior departments and a range of issues related to energy, conservation and public lands.&nbsp;",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "a615fe73-ddf0-3c91-876c-9327c3a846f1"
    },
    {
        "title": "Vance says he's met prospective FBI director candidates with Trump",
        "link": "https://thehill.com/homenews/administration/4998486-jd-vance-donald-trump-fbi-director-candidates/",
        "authors": [
            "Rebecca Beitsch"
        ],
        "date": "Tue, 19 Nov 2024 20:13:10 +0000",
        "summary": "Vice President-elect JD Vance (R-Ohio) revealed the Trump team is interviewing candidates to lead the FBI, a sign of plans to boot current Director Christopher Wray. Vance’s comments came amid a spat on social platform X as he faced criticism for missing a Senate vote in which a judicial nominee of President Biden was approved....",
        "content": "Vice President-elect JD Vance (R-Ohio) revealed the Trump team is interviewing candidates to lead the FBI, a sign of plans to boot current Director Christopher Wray.    Vance’s comments came amid a spat on social platform X as he faced criticism for missing a Senate vote in which a judicial nominee of President Biden was approved.    “When this 11th Circuit vote happened, I was meeting with President Trump to interview multiple positions for our government, including for FBI Director,” Vance wrote on X.    “I tend to think it's more important to get an FBI director who will dismantle the deep state than it is for Republicans to lose a vote 49-46 rather than 49-45,\" he added.    Vance later deleted the tweet, in which he called conservative commentator Grace Chong a \"mouth breathing imbecile.\"    Trump has become a vocal critic of the FBI and its leader, who he nominated to the job in 2017.    FBI directors serve 10-year terms, meaning Wray would not ordinarily leave his post until 2027, though the agency head can be removed by the president.    The FBI declined to comment.    Among the names circulating for a possible new director is Kash Patel, a former national security official during the first Trump administration who is also now a board member for Trump’s media company.    Patel would be a controversial pick for the role, a Trump loyalist who sparked internal battles during President-elect Trump's first term and has parroted his views in seeing the FBI as weaponized agency that improperly investigated him.    “The Deep State can not be trusted. They have weaponized the government for their own political and personal agenda,” Patel wrote in an email last week from his foundation, calling the investigation into Trump’s Russia ties “fraud.”    Former FBI Special Agent Daniel Brunner said if&nbsp;Trump&nbsp;chooses loyalist and former Trump administration aide&nbsp;Kash Patel&nbsp;to lead the FBI, it would do “massive damage” to the agency.    “Putting someone like Kash Patel in the position of director of the FBI is, I believe, extremely, extremely dangerous because … his resume isn’t traditional,” Brunner said Sunday.    Updated at 4:22 p.m. EST",
        "source": "https://thehill.com/homenews/feed/",
        "uid": "094857da-123d-36c8-8bb4-47723d3bbe3f"
    }
]